{
    "head_note":"REPORTABLE\n\n\n\n\n                        IN THE SUPREME COURT OF INDIA\n\n                       CRIMINAL APPELLATE JURISDICTION\n\n                      CRIMINAL APPEAL NO.  1750 OF 2008\n\n\n\n\n      Hardeep Singh\n      ?Appellant\n\n                          ",
    "case_title":"Hardeep Singh vs State Of Punjab & Ors on 10 January, 1947",
    "petitioner_name":"Hardeep Singh ",
    "judgement_html":"<div class=\"docsource_main\">\n Supreme Court of India\n</div> \n<div class=\"doc_title\">\n Hardeep Singh vs State Of Punjab &amp; Ors on 10 January, 1947\n</div>\n<div class=\"doc_author\">\n Author: . B Chauhan\n</div> \n<div class=\"doc_bench\">\n Bench: P Sathasivam, B.S. Chauhan, Ranjana Prakash Desai, Ranjan Gogoi, S.A. Bobde\n</div> \n<pre id=\"pre_1\">                                                                             REPORTABLE\n\n\n\n\n                        IN THE SUPREME COURT OF INDIA\n\n                       CRIMINAL APPELLATE JURISDICTION\n\n                      CRIMINAL APPEAL NO.  1750 OF 2008\n\n\n\n\n      Hardeep Singh\n      ?Appellant\n\n                                   Versus\n\n      State of Punjab &amp; Ors.\n  ?Respondents\n\n                                    With\n\n                     CRIMINAL APPEAL NO.  1751  of 2008\n\n      Manjit Pal Singh\n          ?Appellant\n\n                                   Versus\n\n      State of Punjab &amp; Anr.\n     ?Respondents\n\n                                    With\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  9184  of 2008\n\n      Babubhai Bhimabhai Bokhiria &amp; Anr.\n      ?Appellants\n\n\n\n\n                                   Versus\n\n      State of Gujarat &amp; Ors.\n       ?Respondents\n\n                                    With\n\n\n\n\n\n\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  7209  of 2010\n\n      Rajendra Sharma &amp; Anr.\n      ?Appellants\n\n\n\n\n                                   Versus\n\n      State of M.P. &amp; Anr.\n      ?Respondents\n\n                                    With\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  5724  of 2009\n\n\n\n\n      Ravinder Kumar &amp; Anr.\n       ?Appellants\n\n                                   Versus\n\n      State of Haryana  &amp; Ors.\n      ?Respondents\n\n                                    With\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  5975  of 2009\n\n\n\n\n      Tej Pal &amp; Anr.\n      ?Appellants\n\n                                   Versus\n\n      State of Haryana &amp; Ors.\n      ?Respondents\n\n                                    With\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  9040  of 2010\n\n      Juned Pahalwan\n      ?Appellant\n\n                                   Versus\n\n      State of U.P.&amp; Anr.\n      ?Respondents\n\n                                    With\n\n           SPECIAL LEAVE PETITION (CRL.) NO.  5331 of 2009\n\n      Rajesh @ Sanjai\n      ?Appellant\n\n                                   Versus\n\n      State of U.P. &amp; Anr.\n      ?Respondents\n\n                                    With\n\n        SPECIAL LEAVE PETITION (CRL.) NO.  9157  of 2009\n\n      Ramdhan Mali &amp; Anr.\n      ?Appellants\n\n                                   Versus\n\n      State of Rajasthan &amp; Anr.\n      ?Respondents\n\n                                    With\n\n            SPECIAL LEAVE PETITION (CRL.) NOS. 4503-4504 of 2012\n\n      Tej Singh\n      ?Appellant\n\n                                   Versus\n\n      State of U.P.\n          ?Respondent\n\n\n\n\n\n\n\n                               J U D G M E N T\n</pre> \n<p id=\"p_1\"> Dr. B.S. CHAUHAN, J. </p> \n<p id=\"p_2\"> 1. This reference before us arises out of a variety of views having been expressed by this Court and several High Courts of the country on the scope and extent of the powers of the courts under the criminal justice system to arraign any person as an accused during the course of inquiry or trial as contemplated under Section 319 of the Code of Criminal Procedure, 1973 (hereinafter referred to as the `Cr.P.C.?). </p> \n<p id=\"p_3\"> 2. The initial reference was made by a two-Judge Bench vide order dated 7.11.2008 in the leading case of Hardeep Singh (Crl. Appeal No. 1750 of 2008) where noticing the conflict between the judgments in the case of Rakesh v. State of Haryana, AIR 2001 SC 2521; and a two- Judge Bench decision in the case of Mohd. Shafi v. Mohd. Rafiq &amp; Anr., AIR 2007 SC 1899, a doubt was expressed about the correctness of the view in the case of Mohd. Shafi (Supra). The doubts as categorised in paragraphs 75 and 78 of the reference order led to the framing of two questions by the said Bench which are reproduced hereunder: </p> \n<blockquote id=\"blockquote_1\">\n  ?(1) When the power under sub-section (1) of \n Section 319 of the Code of addition of accused can be exercised by a Court? Whether application under \n Section 319 is not maintainable unless the cross-examination of the witness is complete? \n</blockquote> \n<blockquote id=\"blockquote_2\">\n  (2) What is the test and what are the guidelines of exercising power under sub-section (1) of \n Section 319 of the Code? Whether such power can be exercised only if the Court is satisfied that the accused summoned in all likelihood would be convicted? \n</blockquote> \n<p id=\"p_4\"> 3. The reference was desired to be resolved by a three-Judge Bench whereafter the same came up for consideration and vide order dated 8.12.2011, the Court opined that in view of the reference made in the case of Dharam Pal &amp; Ors. v. State of Haryana &amp; Anr., (2004) 13 SCC 9, the issues involved being identical in nature, the same should be resolved by a Constitution Bench consisting of at least five Judges. The Bench felt that since a three-Judge Bench has already referred the matter of Dharam Pal (Supra) to a Constitution Bench, then in that event it would be appropriate that such overlapping issues should also be resolved by a Bench of similar strength. </p> \n<p id=\"p_5\"> 4. Reference made in the case of Dharam Pal (Supra) came to be answered in relation to the power of a Court of Sessions to invoke Section 319 Cr.P.C. at the stage of committal of the case to a Court of Sessions. The said reference was answered by the Constitution Bench in the case of Dharam Pal &amp; Ors. v. State of Haryana &amp; Anr., AIR 2013 SC 3018 [hereinafter called ?Dharam Pal (CB)?], wherein it was held that a Court of Sessions can with the aid of Section 193 Cr.P.C. proceed to array any other person and summon him for being tried even if the provisions of Section 319 Cr.P.C. could not be pressed in service at the stage of committal. </p> \n<p id=\"p_6\"> Thus, after the reference was made by a three-Judge Bench in the present case, the powers so far as the Court of Sessions is concerned, to invoke Section 319 Cr.P.C. at the stage of committal, stood answered finally in the aforesaid background. </p> \n<p id=\"p_7\"> 5. On the consideration of the submissions raised and in view of what has been noted above, the following questions are to be answered by this Bench: </p> \n<blockquote id=\"blockquote_3\">\n  ?(i) What is the stage at which power under \n Section 319 Cr.P.C. can be exercised? \n</blockquote> \n<blockquote id=\"blockquote_4\">\n  (ii) Whether the word \"evidence\" used in \n Section 319(1) Cr.P.C. could only mean evidence tested by cross-examination or the court can exercise the power under the said provision even on the basis of the statement made in the examination-in-chief of the witness concerned? \n</blockquote> \n<blockquote id=\"blockquote_5\">\n  (iii) Whether the word \"evidence\" used in \n Section 319(1) Cr.P.C. has been used in a comprehensive sense and includes the evidence collected during investigation or the word \"evidence\" is limited to the evidence recorded during trial? \n</blockquote> \n<blockquote id=\"blockquote_6\">\n  (iv) What is the nature of the satisfaction required to invoke the power under \n Section 319 Cr.P.C. to arraign an accused? Whether the power under \n Section 319(1) Cr.P.C. can be exercised only if the court is satisfied that the accused summoned will in all likelihood convicted? \n</blockquote> \n<blockquote id=\"blockquote_7\">\n  (v) Does the power under \n Section 319 Cr.P.C. extend to persons not named in the FIR or named in the FIR but not charged or who have been discharged? \n</blockquote> \n<p id=\"p_8\"> 6. In this reference what we are primarily concerned with, is the stage at which such powers can be invoked and, secondly, the material on the basis whereof the invoking of such powers can be justified. To add as a corollary to the same, thirdly, the manner in which such power has to be exercised, also has to be considered. </p> \n<p id=\"p_9\"> 7. The Constitutional mandate under Articles 20 and 21 of the Constitution of India, 1950 (hereinafter referred to as the ?Constitution?) provides a protective umbrella for the smooth administration of justice making adequate provisions to ensure a fair and efficacious trial so that the accused does not get prejudiced after the law has been put into motion to try him for the offence but at the same time also gives equal protection to victims and to the society at large to ensure that the guilty does not get away from the clutches of law. For the empowerment of the courts to ensure that the criminal administration of justice works properly, the law was appropriately codified and modified by the legislature under the Cr.P.C. indicating as to how the courts should proceed in order to ultimately find out the truth so that an innocent does not get punished but at the same time, the guilty are brought to book under the law. It is these ideals as enshrined under the Constitution and our laws that have led to several decisions, whereby innovating methods and progressive tools have been forged to find out the real truth and to ensure that the guilty does not go unpunished. The presumption of innocence is the general law of the land as every man is presumed to be innocent unless proven to be guilty. </p> \n<p id=\"p_10\"> 8. Alternatively, certain statutory presumptions in relation to certain class of offences have been raised against the accused whereby the presumption of guilt prevails till the accused discharges his burden upon an onus being cast upon him under the law to prove himself to be innocent. These competing theories have been kept in mind by the legislature. The entire effort, therefore, is not to allow the real perpetrator of an offence to get away unpunished. This is also a part of fair trial and in our opinion, in order to achieve this very end that the legislature thought of incorporating provisions of Section 319 Cr.P.C. </p> \n<p id=\"p_11\"> 9. It is with the said object in mind that a constructive and purposive interpretation should be adopted that advances the cause of justice and does not dilute the intention of the statute conferring powers on the court to carry out the above mentioned avowed object and purpose to try the person to the satisfaction of the court as an accomplice in the commission of the offence that is subject matter of trial. </p> \n<p id=\"p_12\"> 10. In order to answer the aforesaid questions posed, it will be appropriate to refer to Section 351 of the Criminal Procedure Code, 1898 (hereinafter referred to as `Old Code?), where an analogous provision existed, empowering the court to summon any person other than the accused if he is found to be connected with the commission of the offence. However, when the new Cr.P.C. was being drafted, regard was had to 41st Report of the Law Commission where in the paragraphs 24.80 and 24.81 recommendations were made to make this provision more comprehensive. The said recommendations read: </p> \n<blockquote id=\"blockquote_8\">\n  ?24.80 It happens sometimes, though not very often, that a Magistrate hearing a case against certain accused finds from the evidence that some person, other than the accused before him, is also concerned in that very offence or in a connected offence. It is proper that Magistrate should have the power to call and join him in proceedings. \n Section 351 provides for such a situation, but only if that person happens to be attending the Court. He can then be detained and proceeded against. There is no express provision in \n Section 351 for summoning such a person if he is not present in court. Such a provision would make \n Section 351 fairly comprehensive, and we think it proper to expressly provide for that situation. \n</blockquote> \n<blockquote id=\"blockquote_9\">\n  24.81 \n Section 351 assumes that the Magistrate proceeding under it has the power of taking cognizance of the new case. It does not, however, say in what manner cognizance is taken by the Magistrate. The modes of taking cognizance are mentioned in \n Section 190, and are apparently exhaustive. The question is, whether against the newly added accused, cognizance will be supposed to have been taken on the Magistrates own information under \n Section 190(1), or only in the manner in which cognizance was first taken of the offence against the accused. The question is important, because the methods of inquiry and trial in the two cases differ. About the true position under the existing law, there has been difference of opinion, and we think it should be made clear. It seems to us that the main purpose of this particular provision is that the whole case against all known suspects should be proceeded with expeditiously and convenience requires that cognizance against the newly added accused should be taken in the same manner against the other accused. We, therefore, propose to recast \n Section 351 making it comprehensive and providing that there will be no difference in the mode of taking cognizance if a new person is added as an accused during the proceedings. It is, of course, necessary (as is already provided) that in such a situation the evidence must he reheard in the presence of the newly added accused.? \n</blockquote>\n<p id=\"p_13\"> 11. Section 319 Cr.P.C. as it exists today, is quoted hereunder: </p> \n<blockquote id=\"blockquote_10\">\n  ?319 \n Cr.P.C. -Power to proceed against other persons appearing to be guilty of offence.- \n</blockquote> \n<blockquote id=\"blockquote_11\">\n  (1) Where, in the course of any inquiry into, or trial of, an offence, it appears from the evidence that any person not being the accused has committed any offence for which such person could be tried together with the accused, the Court may proceed against such person for the offence which he appears to have committed. \n</blockquote> \n<blockquote id=\"blockquote_12\">\n  (2) Where such person is not attending the Court, he may be arrested or summoned, as the circumstances of the case may require, for the purpose aforesaid. \n</blockquote> \n<blockquote id=\"blockquote_13\">\n  (3) Any person attending the Court, although not under arrest or upon a summons, may be detained by such Court for the purpose of the inquiry into, or trial of, the offence which he appears to have committed. \n</blockquote> \n<blockquote id=\"blockquote_14\">\n  (4) Where the Court proceeds against any person under sub- section (1), then- \n</blockquote> \n<blockquote id=\"blockquote_15\">\n  (a) the proceedings in respect of such person shall be commenced afresh, and the witnesses re-heard; \n</blockquote> \n<blockquote id=\"blockquote_16\">\n  (b) subject to the provisions of clause (a), the case may proceed as if such person had been an accused person when the Court took cognizance of the offence upon which the inquiry or trial was commenced.? \n</blockquote>\n<p id=\"p_14\"> 12. Section 319 Cr.P.C. springs out of the doctrine judex damnatur cum nocens absolvitur (Judge is condemned when guilty is acquitted) and this doctrine must be used as a beacon light while explaining the ambit and the spirit underlying the enactment of Section 319 Cr.P.C. </p> \n<p id=\"p_15\"> It is the duty of the Court to do justice by punishing the real culprit. Where the investigating agency for any reason does not array one of the real culprits as an accused, the court is not powerless in calling the said accused to face trial. The question remains under what circumstances and at what stage should the court exercise its power as contemplated in Section 319 Cr.P.C.? </p> \n<p id=\"p_16\"> The submissions that were raised before us covered a very wide canvas and the learned counsel have taken us through various provisions of Cr.P.C. and the judgments that have been relied on for the said purpose. The controversy centers around the stage at which such powers can be invoked by the court and the material on the basis whereof such powers can be exercised. </p> \n<p id=\"p_17\"> 13. It would be necessary to put on record that the power conferred under Section 319 Cr.P.C. is only on the court. </p> \n<p id=\"p_18\"> This has to be understood in the context that Section 319 Cr.P.C. empowers only the court to proceed against such person. The word ?court? in our hierarchy of criminal courts has been defined under Section 6 Cr.P.C., which includes the Courts of Sessions, Judicial Magistrates, Metropolitan Magistrates as well as Executive Magistrates. The Court of Sessions is defined in Section 9 Cr.P.C. and the Courts of Judicial Magistrates has been defined under Section 11 thereof. The Courts of Metropolitan Magistrates has been defined under Section 16 Cr.P.C. The courts which can try offences committed under the Indian Penal Code, 1860 or any offence under any other law, have been specified under Section 26 Cr.P.C. read with First Schedule. The explanatory note (2) under the heading of ?Classification of Offences? under the First Schedule specifies the expression ?magistrate of first class? and ?any magistrate? to include Metropolitan Magistrates who are empowered to try the offences under the said Schedule but excludes Executive Magistrates. </p> \n<p id=\"p_19\"> 14. It is at this stage the comparison of the words used under Section 319 Cr.P.C. has to be understood distinctively from the word used under Section 2(g) defining an inquiry other than the trial by a magistrate or a court. Here the legislature has used two words, namely the magistrate or court, whereas under Section 319 Cr.P.C., as indicated above, only the word ?court? has been recited. This has been done by the legislature to emphasise that the power under Section 319 Cr.P.C. is exercisable only by the court and not by any officer not acting as a court. Thus, the magistrate not functioning or exercising powers as a court can make an inquiry in particular proceeding other than a trial but the material so collected would not be by a court during the course of an inquiry or a trial. The conclusion therefore, in short, is that in order to invoke the power under Section 319 Cr.P.C., it is only a Court of Sessions or a Court of Magistrate performing the duties as a court under the Cr.P.C. that can utilise the material before it for the purpose of the said Section. </p> \n<p id=\"p_20\"> 15. Section 319 Cr.P.C. allows the court to proceed against any person who is not an accused in a case before it. Thus, the person against whom summons are issued in exercise of such powers, has to necessarily not be an accused already facing trial. He can either be a person named in Column 2 of the chargesheet filed under Section 173 Cr.P.C. or a person whose name has been disclosed in any material before the court that is to be considered for the purpose of trying the offence, but not investigated. He has to be a person whose complicity may be indicated and connected with the commission of the offence. </p> \n<p id=\"p_21\"> 16. The legislature cannot be presumed to have imagined all the circumstances and, therefore, it is the duty of the court to give full effect to the words used by the legislature so as to encompass any situation which the court may have to tackle while proceeding to try an offence and not allow a person who deserves to be tried to go scot free by being not arraigned in the trial in spite of possibility of his complicity which can be gathered from the documents presented by the prosecution. </p> \n<p id=\"p_22\"> 17. The court is the sole repository of justice and a duty is cast upon it to uphold the rule of law and, therefore, it will be inappropriate to deny the existence of such powers with the courts in our criminal justice system where it is not uncommon that the real accused, at times, get away by manipulating the investigating and/or the prosecuting agency. The desire to avoid trial is so strong that an accused makes efforts at times to get himself absolved even at the stage of investigation or inquiry even though he may be connected with the commission of the offence. </p> \n<p id=\"p_23\"> 18. Coming to the stage at which power under Section 319 Cr.P.C. can be exercised, in Dharam Pal (Supra), this Court had noticed the conflict in the decisions of Kishun Singh &amp; Ors v. State of Bihar, (1993) 2 SCC 16 and Ranjit Singh v. State of Punjab, AIR 1998 SC 3148, and referred the matter to the Constitution Bench. However, while referring the matter to a Constitution Bench, this Court affirmed the judgment in Kishun Singh (Supra) and doubted the correctness of the judgment in Ranjit Singh (Supra). In Ranjit Singh (Supra), this Court observed that from the stage of committal till the Sessions Court reaches the stage indicated in Section 230 Cr.P.C., that court can deal with only the accused referred to in Section 209 Cr.P.C. and there is no intermediary stage till then for the Sessions Court to add any other person to the array of the accused, while in Kishun Singh (Supra), this Court came to the conclusion that even the Sessions Court has power under Section 193 Cr.P.C. to take cognizance of the offence and summon other persons whose complicity in the commission of the trial can prima facie be gathered from the materials available on record and need not wait till the stage of Section 319 Cr.P.C. is reached. This Court in Dharam Pal (Supra) held that the effect of Ranjit Singh (Supra) would be that in less serious offences triable by a Magistrate, the said Court would have the power to proceed against those who are mentioned in Column 2 of the charge-sheet, if on the basis of material on record, the Magistrate disagrees with the conclusion reached by the police, but, as far as serious offences triable by the Court of Sessions are concerned, that court will have to wait till the stage of Section 319 Cr.P.C. is reached. </p> \n<p id=\"p_24\"> 19. At the very outset, we may explain that the issue that was being considered by this Court in Dharam Pal (CB), was the exercise of such power at the stage of committal of a case and the court held that even if Section 319 Cr.P.C. could not be invoked at that stage, Section 193 Cr.P.C. could be invoked for the said purpose. We are not delving into the said issue which had been answered by the five-Judge Bench of this Court. However, we may clarify that the opening words of Section 193 Cr.P.C. categorically recite that the power of the Court of Sessions to take cognizance would commence only after committal of the case by a magistrate. The said provision opens with a non-obstante clause ?except as otherwise expressly provided by this code or by any other law for the time being in force?. The Section therefore is clarified by the said opening words which clearly means that if there is any other provision under Cr.P.C., expressly making a provision for exercise of powers by the court to take cognizance, then the same would apply and the provisions of Section 193 Cr.P.C. would not be applicable. </p> \n<p id=\"p_25\"> 20. In our opinion, Section 319 Cr.P.C. is an enabling provision empowering the court to take appropriate steps for proceeding against any person not being an accused for also having committed the offence under trial. It is this part which is under reference before this Court and therefore in our opinion, while answering the question referred to herein, we do not find any conflict so as to delve upon the situation that was dealt by this Court in Dharam Pal (CB). </p> \n<p id=\"p_26\"> 21. In Elachuri Venkatachinnayya &amp; Ors. v. King-Emperor (1920) ILR 43 Mad 511, this Court held that an inquiry is a stage before the committal to a higher court. In fact, from a careful reading of the judgments under reference i.e. Ranjit Singh (Supra) and Kishun Singh (Supra), it emerges that there is no dispute even in these two cases that the stage of committal is neither an inquiry nor a trial, for in both the cases, the real dispute was whether Section 193 Cr.P.C. can be invoked at the time of committal to summon an accused to face trial who is not already an accused. It can safely be said that both the cases are in harmony as to the said stage neither being a stage of inquiry nor a trial. </p> \n<p id=\"p_27\"> 22. Once the aforesaid stand is clarified in relation to the stage of committal before the Court of Sessions, the answer to the question posed now, stands focussed only on the stage at which such powers can be exercised by the court other than the stage of committal and the material on the basis whereof such powers can be invoked by the court. </p> \n<p id=\"p_28\"> Question No.(i) What is the stage at which power under Section 319 Cr.P.C. can be exercised? </p> \n<p id=\"p_29\"> 23. The stage of inquiry and trial upon cognizance being taken of an offence, has been considered by a large number of decisions of this Court and that it may be useful to extract the same hereunder for proper appreciation of the stage of invoking of the powers under Section 319 Cr.P.C. to understand the meaning that can be attributed to the word ?inquiry? and ?trial? as used under the Section. </p> \n<p id=\"p_30\"> 24. In Raghubans Dubey v. State of Bihar, AIR 1967 SC 1167, this Court held : </p> \n<blockquote id=\"blockquote_17\">\n  ??once cognizance has been taken by the Magistrate, he takes cognizance of an offence and not the offenders; once he takes cognizance of an offence it is his duty to find out who the offenders really are and once he comes to the conclusion that apart from the persons sent up by the police some other persons are involved, it is his duty to proceed against those persons. The summoning of the additional accused is part of the proceeding initiated by his taking cognizance of an offence.? \n</blockquote>\n<p id=\"p_31\"> 25. The stage of inquiry commences, insofar as the court is concerned, with the filing of the charge-sheet and the consideration of the material collected by the prosecution, that is mentioned in the charge-sheet for the purpose of trying the accused. This has to be understood in terms of Section 2(g) Cr.P.C., which defines an inquiry as follows: </p> \n<p id=\"p_32\"> ?2(g) ?inquiry? means every inquiry, other than a trial, conducted under this Code by a Magistrate or Court.? </p>\n<p id=\"p_33\"> 26. In State of U.P. v. Lakshmi Brahman &amp; Anr., AIR 1983 SC 439, this Court held that from the stage of filing of charge-sheet to ensuring the compliance of provision of Section 207 Cr.P.C., the court is only at the stage of inquiry and no trial can be said to have commenced. The above view has been held to be per incurium in Raj Kishore Prasad v. State of Bihar &amp; Anr., AIR 1996 SC 1931, wherein this Court while observing that Section 319 (1) Cr.P.C. operates in an ongoing inquiry into, or trial of, an offence, held that at the stage of Section 209 Cr.P.C., the court is neither at the stage of inquiry nor at the stage of trial. Even at the stage of ensuring compliance of Sections 207 and 208 Cr.P.C., it cannot be said that the court is at the stage of inquiry because there is no judicial application of mind and all that the Magistrate is required to do is to make the case ready to be heard by the Court of Sessions. </p> \n<p id=\"p_34\"> 27. Trial is distinct from an inquiry and must necessarily succeed it. The purpose of the trial is to fasten the responsibility upon a person on the basis of facts presented and evidence led in this behalf. In Moly &amp; Anr. v. State of Kerala, AIR 2004 SC 1890, this Court observed that though the word ?trial? is not defined in the Code, it is clearly distinguishable from inquiry. Inquiry must always be a forerunner to the trial. A three-Judge Bench of this Court in The State of Bihar v.&nbsp;Ram Naresh Pandey &amp; Anr., AIR 1957 SC 389 held: </p> \n<blockquote id=\"blockquote_18\">\n  ?The words 'tried' and 'trial' appear to have no fixed or universal meaning. No doubt, in quite a number of sections in\n  the Code to which our attention has been drawn the words 'tried' and 'trial' have been used in the sense of reference to a stage after the inquiry. That meaning attaches to the words in those sections having regard to the context in which they are used. There is no reason why where these words are used in another context in\n  the Code, they should necessarily be limited in their connotation and significance. They are words which must be considered with regard to the particular context in which they are used and with regard to the scheme and purpose of the provision under consideration.? (Emphasis added) \n</blockquote>\n<p id=\"p_35\"> 28. In Ratilal Bhanji Mithani v. State of Maharashtra &amp; Ors., AIR 1979 SC 94, this Court held : </p> \n<blockquote id=\"blockquote_19\">\n  ?Once a charge is framed, the Magistrate has no power under \n Section 227 or any other provision\n  of the Code to cancel the charge, and reverse the proceedings to the stage of \n Section 253 and discharge the accused. The trial in a warrant case starts with the framing of charge; prior to it the proceedings are only an inquiry. After the framing of charge if the accused pleads not guilty, the Magistrate is required to proceed with the trial in the manner provided in \n Sections 254 to \n 258 to a logical end.? (Emphasis added) \n</blockquote>\n<p id=\"p_36\"> 29. In V.C. Shukla v. State through C.B.I., AIR 1980 SC 962, this Court held: </p> \n<blockquote id=\"blockquote_20\">\n  ??The proceedings starting with \n Section 238 of the Code including any discharge or framing of charges under \n Section 239 or 240 amount to a trial?? \n</blockquote>\n<p id=\"p_37\"> 30. In Union of India &amp; Ors. v. Major General Madan Lal Yadav (Retd.), AIR 1996 SC 1340, a three-Judge Bench while dealing with the proceedings in General Court Martial under the provisions of the Army Act 1950, applied legal maxim ?nullus commodum capere potest de injuria sua propria? (no one can take advantage of his own wrong), and referred to various dictionary meanings of the word ?trial? and came to the conclusion: </p> \n<blockquote id=\"blockquote_21\">\n  ?It would, therefore, be clear that trial means act of proving or judicial examination or determination of the issues including its own jurisdiction or authority in accordance with law or adjudging guilt or innocence of the accused including all steps necessary thereto. The trial commences with the performance of the first act or steps necessary or essential to proceed with the trial. \n</blockquote>\n<blockquote id=\"blockquote_22\">\n  (Emphasis supplied) X X X X Our conclusion further gets fortified by the scheme of the trial of a criminal case under\n  the Code of Criminal Procedure, 1973, viz., Chapter XIV ?Conditions requisite for initiation of proceedings? containing \n Sections 190 to \n 210, Chapter XVIII containing \n Sections 225 to \n 235 and dealing with ?trial before a Court of Sessions? pursuant to committal order under \n Section 209 and in Chapter XIX ?trial of warrant cases by Magistrates? containing \n Sections 238 to \n 250 etc. It is settled law that under the said Code trial commences the moment cognizance of the offence is taken and process is issued to the accused for his appearance etc. Equally, at a sessions trial, the court considers the committal order under \n Section 209 by the Magistrate and proceeds further. It takes cognizance of the offence from that stage and proceeds with the trial. The trial begins with the taking of the cognizance of the offence and taking further steps to conduct the trial.? (Emphasis supplied) \n</blockquote>\n<p id=\"p_38\"> 31. In ?Common Cause?, A Registered Society thr. its Director v. Union of India &amp; Ors., AIR 1997 SC 1539, this Court while dealing with the issue held: </p> \n<blockquote id=\"blockquote_23\">\n  ?(i) In case of trials before Sessions Court the trials shall be treated to have commenced when charges are framed under \n Section 228 of the Code of Criminal Procedure, 1973 in the concerned cases. \n</blockquote> \n<blockquote id=\"blockquote_24\">\n  ii) In cases of trials of warrant cases by Magistrates if the cases are instituted upon police reports the trials shall be treated to have commenced when charges are framed under \n Section 240 of the Code of Criminal Procedure, 1973, while in trials of warrant cases by Magistrates when cases are instituted otherwise than on police report such trials shall be treated to have commenced when charges are framed against the concerned accused under \n Section 246 of the Code of Criminal Procedure, 1973. \n</blockquote> \n<blockquote id=\"blockquote_25\">\n  iii) In cases of trials of summons cases by Magistrates the trials would be considered to have commenced when the accused who appear or are brought before the Magistrate are asked under \n Section 251 whether they plead guilty or have any defence to make.? (Emphasis added) \n</blockquote>\n<p id=\"p_39\"> 32. In Raj Kishore Prasad (Supra), this Court said that as soon as the prosecutor is present before the court and that court hears the parties on framing of charges and discharge, trial is said to have commenced and that there is no intermediate stage between committal of case and framing of charge. </p> \n<p id=\"p_40\"> 33. In In Re: Narayanaswamy Naidu v. Unknown 1 Ind Cas 228, a Full Bench of the Madras High Court held that ?Trial begins when the accused is charged and called on to answer and then the question before the Court is whether the accused is to be acquitted or convicted and not whether the complaint is to be dismissed or the accused discharged.? A similar view has been taken by Madras High Court subsequently in Sriramulu v. Veerasalingam, (1914) I.L.R. 38 Mad. 585. </p> \n<p id=\"p_41\"> 34. However, the Bombay High Court in Dagdu Govindshet Wani v. Punja Vedu Wani (1936) 38 Bom.L.R. 1189 referring to Sriramulu (Supra) held : </p> \n<blockquote id=\"blockquote_26\">\n  ?There is no doubt that the Court did take the view that in a warrant case the trial only commences from the framing of the charge ?..But, according to my experience of the administration of criminal justice in this Presidency, which is not inconsiderable, the Courts here have always accepted the definition of trial which has been given in \n Gomer Sirda v. Queen-\n</blockquote> \n<p id=\"p_42\"> Empress, (1898) I.L.R. 25 Cal. 863, that is to say, trial has always been understood to mean the proceeding which commences when the case is called on with the Magistrate on the Bench, the accused in the dock and the representatives of the prosecution and, defence, if the accused be defended, present in Court for the hearing of the case.? A similar view has been taken by the Lahore High Court in Sahib Din v. The Crown, (1922) I.L.R. 3 Lah. 115, wherein it was held that for the purposes of Section 350 of the Code, a trial cannot be said to commence only when a charge is framed. The trial covers the whole of the proceedings in a warrant case. This case was followed in Fakhruddin v. The Crown, (1924) I.L.R. 6 Lah. 176; and in Labhsing v. Emperor, (1934) 35 Cr.L. J. 1261. </p> \n<p id=\"p_43\"> 35. In view of the above, the law can be summarised to the effect that as ?trial? means determination of issues adjudging the guilt or the innocence of a person, the person has to be aware of what is the case against him and it is only at the stage of framing of the charges that the court informs him of the same, the ?trial? commences only on charges being framed. Thus, we do not approve the view taken by the courts that in a criminal case, trial commences on cognizance being taken. </p> \n<p id=\"p_44\"> 36. Section 2(g) Cr.P.C. and the case laws referred to above, therefore, clearly envisage inquiry before the actual commencement of the trial, and is an act conducted under Cr.P.C. by the Magistrate or the court. The word ?inquiry? is, therefore, not any inquiry relating to the investigation of the case by the investigating agency but is an inquiry after the case is brought to the notice of the court on the filing of the charge-sheet. The court can thereafter proceed to make inquiries and it is for this reason that an inquiry has been given to mean something other than the actual trial. </p> \n<p id=\"p_45\"> 37. Even the word ?course? occurring in Section 319 Cr.P.C., clearly indicates that the power can be exercised only during the period when the inquiry has been commenced and is going on or the trial which has commenced and is going on. It covers the entire wide range of the process of the pre-trial and the trial stage. The word ?course? therefore, allows the court to invoke this power to proceed against any person from the initial stage of inquiry upto the stage of the conclusion of the trial. The court does not become functus officio even if cognizance is taken so far as it is looking into the material qua any other person who is not an accused. The word ?course? ordinarily conveys a meaning of a continuous progress from one point to the next in time and conveys the idea of a period of time; duration and not a fixed point of time. (See: Commissioner of Income-tax, New Delhi (Now Rajasthan) v. M/s. East West Import &amp; Export (P) Ltd. (Now known as Asian Distributors Ltd.) Jaipur, AIR 1989 SC 836). </p> \n<p id=\"p_46\"> 38. In a somewhat similar manner, it has been attributed to word ?course? the meaning of being a gradual and continuous flow advanced by journey or passage from one place to another with reference to period of time when the movement is in progress. (See: State of Travancore-Cochin &amp; Ors. v. Shanmugha Vilas Cashewnut Factory, Quilon, AIR 1953 SC 333). </p> \n<p id=\"p_47\"> 39. To say that powers under Section 319 Cr.P.C. can be exercised only during trial would be reducing the impact of the word ?inquiry? by the court. It is a settled principle of law that an interpretation which leads to the conclusion that a word used by the legislature is redundant, should be avoided as the presumption is that the legislature has deliberately and consciously used the words for carrying out the purpose of the Act. The legal maxim \"A Verbis Legis Non Est Recedendum\" which means, \"from the words of law, there must be no departure\" has to be kept in mind. </p> \n<p id=\"p_48\"> 40. The court cannot proceed with an assumption that the legislature enacting the statute has committed a mistake and where the language of the statute is plain and unambiguous, the court cannot go behind the language of the statute so as to add or subtract a word playing the role of a political reformer or of a wise counsel to the legislature. The court has to proceed on the footing that the legislature intended what it has said and even if there is some defect in the phraseology etc., it is for others than the court to remedy that defect. The statute requires to be interpreted without doing any violence to the language used therein. The court cannot re-write, recast or reframe the legislation for the reason that it has no power to legislate. </p> \n<p id=\"p_49\"> 41. No word in a statute has to be construed as surplusage. No word can be rendered ineffective or purposeless. Courts are required to carry out the legislative intent fully and completely. While construing a provision, full effect is to be given to the language used therein, giving reference to the context and other provisions of the Statute. By construction, a provision should not be reduced to a ?dead letter? or ?useless lumber?. An interpretation which renders a provision an otiose should be avoided otherwise it would mean that in enacting such a provision, the legislature was involved in ?an exercise in futility? and the product came as a ?purposeless piece? of legislation and that the provision had been enacted without any purpose and the entire exercise to enact such a provision was ?most unwarranted besides being uncharitable.? (Vide: Patel Chunibhai Dajibha etc. v. Narayanrao Khanderao Jambekar &amp; Anr., AIR 1965 SC 1457; The Martin Burn Ltd. v. The Corporation of Calcutta, AIR 1966 SC 529; M.V. Elisabeth &amp; Ors. v. Harwan Investment &amp; Trading Pvt. Ltd. Hanoekar House, Swatontapeth, Vasco-De-Gama, Goa, AIR 1993 SC 1014; Sultana Begum v. Prem Chand Jain, AIR 1997 SC 1006; State of Bihar &amp; Ors. etc.etc. v. Bihar Distillery Ltd. etc. etc., AIR 1997 SC 1511; Institute of Chartered Accountants of India v. M/s. Price Waterhouse &amp; Anr., AIR 1998 SC 74; and The South Central Railway Employees Co- operative Credit Society Employees Union, Secundrabad v. The Registrar of Co-operative Societies &amp; Ors., AIR 1998 SC 703). </p> \n<p id=\"p_50\"> 42. This Court in Rohitash Kumar &amp; Ors. v. Om Prakash Sharma &amp; Ors., AIR 2013 SC 30, after placing reliance on various earlier judgments of this Court held: </p> \n<blockquote id=\"blockquote_27\">\n  ?The Court has to keep in mind the fact that, while interpreting the provisions of a Statute, it can neither add, nor subtract even a single word? A section is to be interpreted by reading all of its parts together, and it is not permissible, to omit any part thereof. The Court cannot proceed with the assumption that the legislature, while enacting the Statute has committed a mistake; it must proceed on the footing that the legislature intended what it has said; even if there is some defect in the phraseology used by it in framing the statute, and it is not open to the court to add and amend, or by construction, make up for the deficiencies, which have been left in the Act??The Statute is not to be construed in light of certain notions that the legislature might have had in mind, or what the legislature is expected to have said, or what the legislature might have done, or what the duty of the legislature to have said or done was. The Courts have to administer the law as they find it, and it is not permissible for the Court to twist the clear language of the enactment, in order to avoid any real, or imaginary hardship which such literal interpretation may cause??.under the garb of interpreting the provision, the Court does not have the power to add or subtract even a single word, as it would not amount to interpretation, but legislation.? Thus, by no means it can be said that provisions of \n Section 319 Cr.P.C. cannot be pressed into service during the course of ?inquiry?. \n</blockquote>\n<p id=\"p_51\"> The word ?inquiry? is not surpulsage in the said provision. </p> \n<p id=\"p_52\"> 43. Since after the filing of the charge-sheet, the court reaches the stage of inquiry and as soon as the court frames the charges, the trial commences, and therefore, the power under Section 319(1) Cr.P.C. can be exercised at any time after the charge-sheet is filed and before the pronouncement of judgment, except during the stage of Section 207/208 Cr.P.C., committal etc., which is only a pre-trial stage, intended to put the process into motion. This stage cannot be said to be a judicial step in the true sense for it only requires an application of mind rather than a judicial application of mind. </p> \n<p id=\"p_53\"> 44. At this pre-trial stage, the Magistrate is required to perform acts in the nature of administrative work rather than judicial such as ensuring compliance of Sections 207 and 208 Cr.P.C., and committing the matter if it is exclusively triable by Sessions Court. Therefore, it would be legitimate for us to conclude that the Magistrate at the stage of Sections 207 to 209 Cr.P.C. is forbidden, by express provision of Section 319 Cr.P.C., to apply his mind to the merits of the case and determine as to whether any accused needs to be added or subtracted to face trial before the Court of Sessions. </p> \n<p id=\"p_54\"> 45. It may be pertinent to refer to the decision in the case of Raj Kishore Prasad (supra) where, in order to avoid any delay in trial, the court emphasised that such a power should be exercised keeping in view the context in which the words ?inquiry? and ?trial? have been used under Section 319 Cr.P.C. and came to the conclusion that such a power is not available at the pre-trial stage and should be invoked only at the stage of inquiry or after evidence is recorded. </p> \n<p id=\"p_55\"> 46. A two-Judge Bench of this Court in M/s. SWIL Ltd. v. State of Delhi &amp; Anr., AIR 2001 SC 2747, held that once the process has been issued, power under Section 319 Cr.P.C. cannot be exercised as at that stage, since it is neither an inquiry nor a trial. </p>\n<p id=\"p_56\"> In Ranjit Singh (Supra), the Court held : </p>\n<p id=\"p_57\"> ?So from the stage of committal till the Sessions Court reaches the stage indicated in Section 230 of the Code, that court can deal with only the accused referred to in Section 209 of the Code. There is no intermediary stage till then for the Sessions Court to add any other person to the array of the accused. Thus, once the Sessions Court takes cognizance of the offence pursuant to the committal order, the only other stage when the court is empowered to add any other person to the array of the accused is after reaching evidence collection when powers under Section 319 of the Code can be invoked? </p>\n<p id=\"p_58\"> 47. In Kishun Singh (Supra), the Court while considering the provision of the old Code, the Law Commission?s Recommendation and the provisions in the Cr.P.C., held that Section 319 Cr.P.C. is an improved provision upon the earlier one. It has removed the difficulty of taking cognizance as cognizance against the added person would be deemed to have been taken as originally against the other co-accused. Therefore, on Magistrate committing the case under Section 209 Cr.P.C. to the Court of Sessions, the bar of Section 193 Cr.P.C. gets lifted thereby investing the Court of Sessions complete and unfettered jurisdiction of the court of original jurisdiction to take cognizance of the offence which would include the summoning of the person or persons whose complicity in the commission of the crime can prima facie be gathered from the material available on record, though who is not an accused before the court. </p> \n<p id=\"p_59\"> 48. In Dharam Pal (CB), the Constitution Bench approved the decision in Kishun Singh (Supra) that the Sessions Judge has original power to summon accused holding that ?the Sessions Judge was entitled to issue summons under Section&nbsp;193&nbsp;Code of Criminal Procedure upon the case being committed to him by the Magistrate. The key words in Section 193 are that \"no Court of Session shall take cognizance of any offence as a Court of original jurisdiction unless the case has been committed to it by a Magistrate under this Code.\" The above provision entails that a case must, first of all, be committed to the Court of Session by the Magistrate. The second condition is that only after the case had been committed to it, could the Court of Session take cognizance of the offence exercising original jurisdiction. Although, an attempt has been made to suggest that the cognizance indicated in Section&nbsp;193&nbsp;deals not with cognizance of an offence, but of the commitment order passed by the learned Magistrate, we are not inclined to accept such a submission in the clear wordings of Section&nbsp;193 that the Court of Session may take cognizance of the offences under the said Section? </p>\n<p id=\"p_60\"> 49. It is thus aptly clear that until and unless the case reaches the stage of inquiry or trial by the court, the power under Section 319 Cr.P.C. cannot be exercised. In fact, this proposition does not seem to have been disturbed by the Constitution Bench in Dharam Pal (CB). The dispute therein was resolved visualizing a situation wherein the court was concerned with procedural delay and was of the opinion that the Sessions Court should not necessarily wait till the stage of Section 319 Cr.P.C. is reached to direct a person, not facing trial, to appear and face trial as an accused. We are in full agreement with the interpretation given by the Constitution Bench that Section 193 Cr.P.C. confers power of original jurisdiction upon the Sessions Court to add an accused once the case has been committed to it. </p> \n<p id=\"p_61\"> 50. In our opinion, the stage of inquiry does not contemplate any evidence in its strict legal sense, nor the legislature could have contemplated this inasmuch as the stage for evidence has not yet arrived. The only material that the court has before it is the material collected by the prosecution and the court at this stage prima facie can apply its mind to find out as to whether a person, who can be an accused, has been erroneously omitted from being arraigned or has been deliberately excluded by the prosecuting agencies. This is all the more necessary in order to ensure that the investigating and the prosecuting agencies have acted fairly in bringing before the court those persons who deserve to be tried and to prevent any person from being deliberately shielded when they ought to have been tried. This is necessary to usher faith in the judicial system whereby the court should be empowered to exercise such powers even at the stage of inquiry and it is for this reason that the legislature has consciously used separate terms, namely, inquiry or trial in Section 319 Cr.P.C. </p> \n<p id=\"p_62\"> Accordingly, we hold that the court can exercise the power under Section 319 Cr.P.C. only after the trial proceeds and commences with the recording of the evidence and also in exceptional circumstances as explained herein above. </p> \n<p id=\"p_63\"> 51. There is yet another set of provisions which form part of inquiry relevant for the purposes of Section 319 Cr.P.C. i.e. provisions of Sections 200, 201, 202, etc. Cr.P.C. applicable in the case of Complaint Cases. As has been discussed herein, evidence means evidence adduced before the court. Complaint Cases is a distinct category of criminal trial where some sort of evidence in the strict legal sense of Section 3 of the Evidence Act 1872, (hereinafter referred to as the ?Evidence Act?) comes before the court. There does not seem to be any restriction in the provisions of Section 319 Cr.P.C. so as to preclude such evidence as coming before the court in Complaint Cases even before charges have been framed or the process has been issued. But at that stage as there is no accused before the Court, such evidence can be used only to corroborate the evidence recorded during the trial for the purpose of Section 319 Cr.P.C., if so required. </p> \n<p id=\"p_64\"> 52. What is essential for the purpose of the section is that there should appear some evidence against a person not proceeded against and the stage of the proceedings is irrelevant. Where the complainant is circumspect in proceeding against several persons, but the court is of the opinion that there appears to be some evidence pointing to the complicity of some other persons as well, Section 319 Cr.P.C. acts as an empowering provision enabling the court/Magistrate to initiate proceedings against such other persons. The purpose of Section 319 Cr.P.C. is to do complete justice and to ensure that persons who ought to have been tried as well are also tried. Therefore, there does not appear to be any difficulty in invoking powers of Section 319 Cr.P.C. at the stage of trial in a complaint case when the evidence of the complainant as well as his witnesses is being recorded. </p> \n<p id=\"p_65\"> 53. Thus, the application of the provisions of Section 319 Cr.P.C., at the stage of inquiry is to be understood in its correct perspective. The power under Section 319 Cr.P.C. can be exercised only on the basis of the evidence adduced before the court during a trial. So far as its application during the course of inquiry is concerned, it remains limited as referred to hereinabove, adding a person as an accused, whose name has been mentioned in Column 2 of the charge sheet or any other person who might be an accomplice. </p> \n<p id=\"p_66\"> Question No.(iii) : Whether the word \"evidence\" used in Section 319(1) Cr.P.C. has been used in a comprehensive sense and includes the evidence collected during investigation or the word \"evidence\" is limited to the evidence recorded during trial? </p> \n<p id=\"p_67\"> 54. To answer the questions and to resolve the impediment that is being faced by the trial courts in exercising of powers under Section 319 Cr.P.C., the issue has to be investigated by examining the circumstances which give rise to a situation for the court to invoke such powers. The circumstances that lead to such inference being drawn up by the court for summoning a person arise out of the availability of the facts and material that comes up before the court and are made the basis for summoning such a person as an accomplice to the offence alleged to have been committed. The material should disclose the complicity of the person in the commission of the offence which has to be the material that appears from the evidence during the course of any inquiry into or trial of offence. The words as used in Section 319 Cr.P.C. indicate that the material has to be ?where ?.it appears from the evidence? before the court. </p> \n<p id=\"p_68\"> 55. Before we answer this issue, let us examine the meaning of the word ?evidence?. According to Section 3 of the Evidence Act, ?evidence? means and includes: </p> \n<blockquote id=\"blockquote_28\">\n  &nbsp;(1) all statements which the Court permits or requires to be made before it by witnesses, in relation to matters of fact under inquiry; such statements are called oral evidence; \n</blockquote> \n<blockquote id=\"blockquote_29\">\n  &nbsp;(2)&nbsp; all documents including electronic records produced for the inspection of the Court, such statements are called documentary evidence; \n</blockquote> \n<p id=\"p_69\"> 56. According to Tomlin?s Law Dictionary, Evidence is ?the means from which an inference may logically be drawn as to the existence of a fact. It consists of proof by testimony of witnesses, on oath; or by writing or records.? Bentham defines ?evidence? as ?any matter of fact, the effect, tendency or design of which presented to mind, is to produce in the mind a persuasion concerning the existence of some other matter of fact- a persuasion either affirmative or disaffirmative of its existence. Of the two facts so connected, the latter may be distinguished as the principal fact, and the former as the evidentiary fact.? According to Wigmore on Evidence, evidence represents ?any knowable fact or group of facts, not a legal or a logical principle, considered with a view to its being offered before a legal tribunal for the purpose of producing a persuasion, positive or negative, on the part of the tribunal, as to the truth of a proposition, not of law, or of logic, on which the determination of the tribunal is to be asked.? </p>\n<p id=\"p_70\"> 57. The provision and the above-mentioned definitions clearly suggest that it is an exhaustive definition. Wherever the words ?means and include? are used, it is an indication of the fact that the definition ?is a hard and fast definition?, and no other meaning can be assigned to the expression that is put down in the definition. It indicates an exhaustive explanation of the meaning which, for the purposes of the Act, must invariably be attached to these words or expression. (Vide: M/s. Mahalakshmi Oil Mills v. State of A.P., AIR 1989 SC 335; Punjab Land Development and Reclamation Corporation Ltd., Chandigarh v. Presiding Officer, Labour Court, Chandigarh &amp; Ors., (1990) 3 SCC 682; P. Kasilingam &amp; Ors. v. P.S.G. College of Technology &amp; Ors., AIR 1995 SC 1395; Hamdard (Wakf) Laboratories v. Dy. Labour Commissioner &amp; Ors., AIR 2008 SC 968; and Ponds India Ltd. (merged with H.L. Limited) v. Commissioner of Trade Tax, Lucknow, (2008) 8 SCC 369). </p> \n<p id=\"p_71\"> 58. In Feroze N. Dotivala v. P.M. Wadhwani &amp; Ors., (2003) 1 SCC 433, dealing with a similar issue, this Court observed as under: </p> \n<blockquote id=\"blockquote_30\">\n  ?Generally, ordinary meaning is to be assigned to any word or phrase used or defined in a statute. Therefore, unless there is any vagueness or ambiguity, no occasion will arise to interpret the term in a manner which may add something to the meaning of the word which ordinarily does not so mean by the definition itself, more particularly, where it is a restrictive definition. Unless there are compelling reasons to do so, meaning of a restrictive and exhaustive definition would not be expanded or made extensive to embrace things which are strictly not within the meaning of the word as defined.? We, therefore proceed to examine the matter further on the premise that the definition of word ?evidence? under the \n Evidence Act is exhaustive. \n</blockquote> \n<p id=\"p_72\"> 59. In Kalyan Kumar Gogoi v. Ashutosh Agnihotri &amp; Anr., AIR 2011 SC 760, while dealing with the issue this Court held : </p> \n<blockquote id=\"blockquote_31\">\n  ?18. The word ?evidence? is used in common parlance in three different senses: (a) as equivalent to relevant, (b) as equivalent to proof, and (c) as equivalent to the material, on the basis of which courts come to a conclusion about the existence or non-existence of disputed facts. Though, in the definition of the word ?evidence? given in \n Section 3 of the Evidence Act one finds only oral and documentary evidence, this word is also used in phrases such as best evidence, circumstantial evidence, corroborative evidence, derivative evidence, direct evidence, documentary evidence, hearsay evidence, indirect evidence, oral evidence, original evidence, presumptive evidence, primary evidence, real evidence, secondary evidence, substantive evidence, testimonial evidence, etc.? \n</blockquote>\n<p id=\"p_73\"> 60. In relation to a Civil Case, this court in Ameer Trading Corporation Ltd. v. Shapoorji Data Processing Ltd., AIR 2004 SC 355, held that the examination of a witness would include evidence-in- chief, cross-examination or re-examination. In Omkar Namdeo Jadhao &amp; Ors v. Second Additional Sessions Judge Buldana &amp; Anr., AIR 1997 SC 331; and Ram Swaroop &amp; Ors. v. State of Rajasthan, AIR 2004 SC 2943, this Court held that statements recorded under Section 161 Cr.P.C. during the investigation are not evidence. Such statements can be used at the trial only for contradictions or omissions when the witness is examined in the court. </p> \n<p id=\"p_74\"> (See also: Podda Narayana &amp; Ors. v. State of A.P., AIR 1975 SC 1252; Sat Paul v. Delhi Administration, AIR 1976 SC 294; and State (Delhi Administration) v. Laxman Kumar &amp; Ors., AIR 1986 SC 250). </p> \n<p id=\"p_75\"> 61. In Lok Ram v. Nihal Singh &amp; Anr., AIR 2006 SC 1892, it was held that it is evident that a person, even though had initially been named in the FIR as an accused, but not charge-sheeted, can also be added as an accused to face the trial. The trial court can take such a step to add such persons as accused only on the basis of evidence adduced before it and not on the basis of materials available in the charge- sheet or the case diary, because such materials contained in the charge-sheet or the case diary do not constitute evidence. </p> \n<p id=\"p_76\"> 62. The majority view of the Constitution Bench in Ramnarayan Mor &amp; Anr. v. The State of Maharashtra, AIR 1964 SC 949 has been as under: </p>\n<blockquote id=\"blockquote_32\">\n  ?9. It was urged in the alternative by counsel for the appellants that even if the expression ?evidence? may include documents, such documents would only be those which are duly proved at the enquiry for commitment, because what may be used in a trial, civil or criminal, to support the judgment of a Court is evidence duly proved according to law. But by the \n Evidence Act which applies to the trial of all criminal cases, the expression ?evidence? is defined in \n Section 3 as meaning and including all statements which the Court permits or requires to be made before it by witnesses, in relation to matters of fact under enquiry and documents produced for the inspection of the Court. There is no restriction in this definition to documents which are duly proved by evidence.? (Emphasis added) \n</blockquote>\n<p id=\"p_77\"> 63. Similarly, this Court in Sunil Mehta &amp; Anr. v. State of Gujarat &amp; Anr., JT 2013 (3) SC 328, held that ?It is trite that evidence within the meaning of the Evidence Act and so also within the meaning of Section&nbsp;244 of the Cr.P.C. is what is recorded in the manner stipulated under Section 138 in the case of oral evidence. Documentary evidence would similarly be evidence only if the documents are proved in the manner recognised and provided for under the Evidence Act unless of course a statutory provision makes the document admissible as evidence without any formal proof thereof.? </p>\n<p id=\"p_78\"> 64. In Guriya @ Tabassum Tauquir &amp; Ors. v. State of Bihar &amp; Anr., AIR 2008 SC 95, this Court held that in exercise of the powers under Section 319 Cr.P.C., the court can add a new accused only on the basis of evidence adduced before it and not on the basis of materials available in the charge sheet or the case diary. </p> \n<p id=\"p_79\"> 65. In Kishun Singh (Supra), this Court held : </p> \n<blockquote id=\"blockquote_33\">\n  ?11. On a plain reading of sub-section (1) of \n Section 319 there can be no doubt that it must appear from the evidence tendered in the course of any inquiry or trial that any person not being the accused has committed any offence for which he could be tried together with the accused. This power (under \n Section 319(1)), it seems clear to us, can be exercised only if it so appears from the evidence at the trial and not otherwise. Therefore, this sub-section contemplates existence of some evidence appearing in the course of trial wherefrom the court can prima facie conclude that the person not arraigned before it is also involved in the commission of the crime for which he can be tried with those already named by the police. Even a person who has earlier been discharged would fall within the sweep of the power conferred by\n  S. 319 of the Code. Therefore, stricto sensu, \n Section 319 of the Code cannot be invoked in a case like the present one where no evidence has been led at a trial wherefrom it can be said that the appellants appear to have been involved in the commission of the crime along with those already sent up for trial by the prosecution. \n</blockquote> \n<blockquote id=\"blockquote_34\">\n  12. But then it must be conceded that \n Section 319 covers the post-cognizance stage where in the course of an inquiry or trial the involvement or complicity of a person or persons not named by the investigating agency has surfaced which necessitates the exercise of the discretionary power conferred by the said provision?..? \n</blockquote>\n<p id=\"p_80\"> 66. A similar view has been taken by this Court in Raj Kishore Prasad (Supra), wherein it was held that in order to apply Section 319 Cr.P.C., it is essential that the need to proceed against the person other than the accused appearing to be guilty of offence arises only on evidence recorded in the course of an inquiry or trial. </p> \n<p id=\"p_81\"> 67. In Lal Suraj @ Suraj Singh &amp; Anr. v. State of Jharkhand, (2009) 2 SCC 696, a two-Judge Bench of this Court held that ?a court framing a charge would have before it all the materials on record which were required to be proved by the prosecution. In a case where, however, the court exercises its jurisdiction under Section 319 Cr.P.C., the power has to be exercised on the basis of the fresh evidence brought before the court. There lies a fine but clear distinction.? </p>\n<p id=\"p_82\"> 68. A similar view has been reiterated by this Court in Rajendra Singh v. State of U.P. &amp; Anr., AIR 2007 SC 2786, observing that court should not exercise the power under Section 319 Cr.P.C. on the basis of materials available in the charge-sheet or the case diary, because such materials contained in the charge-sheet or the case diary do not constitute evidence. The word ?evidence? in Section 319 Cr.P.C. contemplates the evidence of witnesses given in the court. </p> \n<p id=\"p_83\"> 69. Ordinarily, it is only after the charges are framed that the stage of recording of evidence is reached. A bare perusal of Section 227 Cr.P.C. would show that the legislature has used the terms ?record of the case? and the ?documents submitted therewith?. It is in this context that the word ?evidence? as appearing in Section 319 Cr.P.C. has to be read and understood. The material collected at the stage of investigation can at best be used for a limited purpose as provided under Section 157 of the Evidence Act i.e. to corroborate or contradict the statements of the witnesses recorded before the court. Therefore, for the exercise of power under Section 319 Cr.P.C., the use of word `evidence? means material that has come before the court during an inquiry or trial by it and not otherwise. If from the evidence led in the trial the court is of the opinion that a person not accused before it has also committed the offence, it may summon such person under Section 319 Cr.P.C. </p> \n<p id=\"p_84\"> 70. With respect to documentary evidence, it is sufficient, as can be seen from a bare perusal of Section 3 of the Evidence Act as well as the decision of the Constitution Bench, that a document is required to be produced and proved according to law to be called evidence. Whether such evidence is relevant, irrelevant, admissible or inadmissible, is a matter of trial. </p> \n<p id=\"p_85\"> 71. It is, therefore, clear that the word ?evidence? in Section 319 Cr.P.C. means only such evidence as is made",
    "final_date":"-725088600000",
    "citation_name":". B Chauhan",
    "respondent_name":" State Of Punjab & Ors ",
    "date_of_judgement":" 10 January, 1947",
    "solr_date":"1947-01-10T00:00:00Z",
    "id":"1",
    "court_name":"Supreme Court of India",
    "judge_name":"P Sathasivam, B.S. Chauhan, Ranjana Prakash Desai, Ranjan Gogoi, S.A. Bobde",
    "judgement":"Supreme Court of India Hardeep Singh vs State Of Punjab & Ors on 10 January, 1947 Author: . B Chauhan Bench: P Sathasivam, B.S. Chauhan, Ranjana Prakash Desai, Ranjan Gogoi, S.A. Bobde                                                                              REPORTABLE\n\n\n\n\n                        IN THE SUPREME COURT OF INDIA\n\n                       CRIMINAL APPELLATE JURISDICTION\n\n                      CRIMINAL APPEAL NO.  1750 OF 2008\n\n\n\n\n      Hardeep Singh\n      ?Appellant\n\n                                   Versus\n\n      State of Punjab & Ors.\n  ?Respondents\n\n                                    With\n\n                     CRIMINAL APPEAL NO.  1751  of 2008\n\n      Manjit Pal Singh\n          ?Appellant\n\n                                   Versus\n\n      State of Punjab & Anr.\n     ?Respondents\n\n                                    With\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  9184  of 2008\n\n      Babubhai Bhimabhai Bokhiria & Anr.\n      ?Appellants\n\n\n\n\n                                   Versus\n\n      State of Gujarat & Ors.\n       ?Respondents\n\n                                    With\n\n\n\n\n\n\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  7209  of 2010\n\n      Rajendra Sharma & Anr.\n      ?Appellants\n\n\n\n\n                                   Versus\n\n      State of M.P. & Anr.\n      ?Respondents\n\n                                    With\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  5724  of 2009\n\n\n\n\n      Ravinder Kumar & Anr.\n       ?Appellants\n\n                                   Versus\n\n      State of Haryana  & Ors.\n      ?Respondents\n\n                                    With\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  5975  of 2009\n\n\n\n\n      Tej Pal & Anr.\n      ?Appellants\n\n                                   Versus\n\n      State of Haryana & Ors.\n      ?Respondents\n\n                                    With\n\n              SPECIAL LEAVE PETITION (CRL.) NO.  9040  of 2010\n\n      Juned Pahalwan\n      ?Appellant\n\n                                   Versus\n\n      State of U.P.& Anr.\n      ?Respondents\n\n                                    With\n\n           SPECIAL LEAVE PETITION (CRL.) NO.  5331 of 2009\n\n      Rajesh @ Sanjai\n      ?Appellant\n\n                                   Versus\n\n      State of U.P. & Anr.\n      ?Respondents\n\n                                    With\n\n        SPECIAL LEAVE PETITION (CRL.) NO.  9157  of 2009\n\n      Ramdhan Mali & Anr.\n      ?Appellants\n\n                                   Versus\n\n      State of Rajasthan & Anr.\n      ?Respondents\n\n                                    With\n\n            SPECIAL LEAVE PETITION (CRL.) NOS. 4503-4504 of 2012\n\n      Tej Singh\n      ?Appellant\n\n                                   Versus\n\n      State of U.P.\n          ?Respondent\n\n\n\n\n\n\n\n                               J U D G M E N T\n Dr. B.S. CHAUHAN, J. 1. This reference before us arises out of a variety of views having been expressed by this Court and several High Courts of the country on the scope and extent of the powers of the courts under the criminal justice system to arraign any person as an accused during the course of inquiry or trial as contemplated under Section 319 of the Code of Criminal Procedure, 1973 (hereinafter referred to as the `Cr.P.C.?). 2. The initial reference was made by a two-Judge Bench vide order dated 7.11.2008 in the leading case of Hardeep Singh (Crl. Appeal No. 1750 of 2008) where noticing the conflict between the judgments in the case of Rakesh v. State of Haryana, AIR 2001 SC 2521; and a two- Judge Bench decision in the case of Mohd. Shafi v. Mohd. Rafiq & Anr., AIR 2007 SC 1899, a doubt was expressed about the correctness of the view in the case of Mohd. Shafi (Supra). The doubts as categorised in paragraphs 75 and 78 of the reference order led to the framing of two questions by the said Bench which are reproduced hereunder: ?(1) When the power under sub-section (1) of Section 319 of the Code of addition of accused can be exercised by a Court? Whether application under Section 319 is not maintainable unless the cross-examination of the witness is complete? (2) What is the test and what are the guidelines of exercising power under sub-section (1) of Section 319 of the Code? Whether such power can be exercised only if the Court is satisfied that the accused summoned in all likelihood would be convicted? 3. The reference was desired to be resolved by a three-Judge Bench whereafter the same came up for consideration and vide order dated 8.12.2011, the Court opined that in view of the reference made in the case of Dharam Pal & Ors. v. State of Haryana & Anr., (2004) 13 SCC 9, the issues involved being identical in nature, the same should be resolved by a Constitution Bench consisting of at least five Judges. The Bench felt that since a three-Judge Bench has already referred the matter of Dharam Pal (Supra) to a Constitution Bench, then in that event it would be appropriate that such overlapping issues should also be resolved by a Bench of similar strength. 4. Reference made in the case of Dharam Pal (Supra) came to be answered in relation to the power of a Court of Sessions to invoke Section 319 Cr.P.C. at the stage of committal of the case to a Court of Sessions. The said reference was answered by the Constitution Bench in the case of Dharam Pal & Ors. v. State of Haryana & Anr., AIR 2013 SC 3018 [hereinafter called ?Dharam Pal (CB)?], wherein it was held that a Court of Sessions can with the aid of Section 193 Cr.P.C. proceed to array any other person and summon him for being tried even if the provisions of Section 319 Cr.P.C. could not be pressed in service at the stage of committal. Thus, after the reference was made by a three-Judge Bench in the present case, the powers so far as the Court of Sessions is concerned, to invoke Section 319 Cr.P.C. at the stage of committal, stood answered finally in the aforesaid background. 5. On the consideration of the submissions raised and in view of what has been noted above, the following questions are to be answered by this Bench: ?(i) What is the stage at which power under Section 319 Cr.P.C. can be exercised? (ii) Whether the word \"evidence\" used in Section 319(1) Cr.P.C. could only mean evidence tested by cross-examination or the court can exercise the power under the said provision even on the basis of the statement made in the examination-in-chief of the witness concerned? (iii) Whether the word \"evidence\" used in Section 319(1) Cr.P.C. has been used in a comprehensive sense and includes the evidence collected during investigation or the word \"evidence\" is limited to the evidence recorded during trial? (iv) What is the nature of the satisfaction required to invoke the power under Section 319 Cr.P.C. to arraign an accused? Whether the power under Section 319(1) Cr.P.C. can be exercised only if the court is satisfied that the accused summoned will in all likelihood convicted? (v) Does the power under Section 319 Cr.P.C. extend to persons not named in the FIR or named in the FIR but not charged or who have been discharged? 6. In this reference what we are primarily concerned with, is the stage at which such powers can be invoked and, secondly, the material on the basis whereof the invoking of such powers can be justified. To add as a corollary to the same, thirdly, the manner in which such power has to be exercised, also has to be considered. 7. The Constitutional mandate under Articles 20 and 21 of the Constitution of India, 1950 (hereinafter referred to as the ?Constitution?) provides a protective umbrella for the smooth administration of justice making adequate provisions to ensure a fair and efficacious trial so that the accused does not get prejudiced after the law has been put into motion to try him for the offence but at the same time also gives equal protection to victims and to the society at large to ensure that the guilty does not get away from the clutches of law. For the empowerment of the courts to ensure that the criminal administration of justice works properly, the law was appropriately codified and modified by the legislature under the Cr.P.C. indicating as to how the courts should proceed in order to ultimately find out the truth so that an innocent does not get punished but at the same time, the guilty are brought to book under the law. It is these ideals as enshrined under the Constitution and our laws that have led to several decisions, whereby innovating methods and progressive tools have been forged to find out the real truth and to ensure that the guilty does not go unpunished. The presumption of innocence is the general law of the land as every man is presumed to be innocent unless proven to be guilty. 8. Alternatively, certain statutory presumptions in relation to certain class of offences have been raised against the accused whereby the presumption of guilt prevails till the accused discharges his burden upon an onus being cast upon him under the law to prove himself to be innocent. These competing theories have been kept in mind by the legislature. The entire effort, therefore, is not to allow the real perpetrator of an offence to get away unpunished. This is also a part of fair trial and in our opinion, in order to achieve this very end that the legislature thought of incorporating provisions of Section 319 Cr.P.C. 9. It is with the said object in mind that a constructive and purposive interpretation should be adopted that advances the cause of justice and does not dilute the intention of the statute conferring powers on the court to carry out the above mentioned avowed object and purpose to try the person to the satisfaction of the court as an accomplice in the commission of the offence that is subject matter of trial. 10. In order to answer the aforesaid questions posed, it will be appropriate to refer to Section 351 of the Criminal Procedure Code, 1898 (hereinafter referred to as `Old Code?), where an analogous provision existed, empowering the court to summon any person other than the accused if he is found to be connected with the commission of the offence. However, when the new Cr.P.C. was being drafted, regard was had to 41st Report of the Law Commission where in the paragraphs 24.80 and 24.81 recommendations were made to make this provision more comprehensive. The said recommendations read: ?24.80 It happens sometimes, though not very often, that a Magistrate hearing a case against certain accused finds from the evidence that some person, other than the accused before him, is also concerned in that very offence or in a connected offence. It is proper that Magistrate should have the power to call and join him in proceedings. Section 351 provides for such a situation, but only if that person happens to be attending the Court. He can then be detained and proceeded against. There is no express provision in Section 351 for summoning such a person if he is not present in court. Such a provision would make Section 351 fairly comprehensive, and we think it proper to expressly provide for that situation. 24.81 Section 351 assumes that the Magistrate proceeding under it has the power of taking cognizance of the new case. It does not, however, say in what manner cognizance is taken by the Magistrate. The modes of taking cognizance are mentioned in Section 190, and are apparently exhaustive. The question is, whether against the newly added accused, cognizance will be supposed to have been taken on the Magistrates own information under Section 190(1), or only in the manner in which cognizance was first taken of the offence against the accused. The question is important, because the methods of inquiry and trial in the two cases differ. About the true position under the existing law, there has been difference of opinion, and we think it should be made clear. It seems to us that the main purpose of this particular provision is that the whole case against all known suspects should be proceeded with expeditiously and convenience requires that cognizance against the newly added accused should be taken in the same manner against the other accused. We, therefore, propose to recast Section 351 making it comprehensive and providing that there will be no difference in the mode of taking cognizance if a new person is added as an accused during the proceedings. It is, of course, necessary (as is already provided) that in such a situation the evidence must he reheard in the presence of the newly added accused.? 11. Section 319 Cr.P.C. as it exists today, is quoted hereunder: ?319 Cr.P.C. -Power to proceed against other persons appearing to be guilty of offence.- (1) Where, in the course of any inquiry into, or trial of, an offence, it appears from the evidence that any person not being the accused has committed any offence for which such person could be tried together with the accused, the Court may proceed against such person for the offence which he appears to have committed. (2) Where such person is not attending the Court, he may be arrested or summoned, as the circumstances of the case may require, for the purpose aforesaid. (3) Any person attending the Court, although not under arrest or upon a summons, may be detained by such Court for the purpose of the inquiry into, or trial of, the offence which he appears to have committed. (4) Where the Court proceeds against any person under sub- section (1), then- (a) the proceedings in respect of such person shall be commenced afresh, and the witnesses re-heard; (b) subject to the provisions of clause (a), the case may proceed as if such person had been an accused person when the Court took cognizance of the offence upon which the inquiry or trial was commenced.? 12. Section 319 Cr.P.C. springs out of the doctrine judex damnatur cum nocens absolvitur (Judge is condemned when guilty is acquitted) and this doctrine must be used as a beacon light while explaining the ambit and the spirit underlying the enactment of Section 319 Cr.P.C. It is the duty of the Court to do justice by punishing the real culprit. Where the investigating agency for any reason does not array one of the real culprits as an accused, the court is not powerless in calling the said accused to face trial. The question remains under what circumstances and at what stage should the court exercise its power as contemplated in Section 319 Cr.P.C.? The submissions that were raised before us covered a very wide canvas and the learned counsel have taken us through various provisions of Cr.P.C. and the judgments that have been relied on for the said purpose. The controversy centers around the stage at which such powers can be invoked by the court and the material on the basis whereof such powers can be exercised. 13. It would be necessary to put on record that the power conferred under Section 319 Cr.P.C. is only on the court. This has to be understood in the context that Section 319 Cr.P.C. empowers only the court to proceed against such person. The word ?court? in our hierarchy of criminal courts has been defined under Section 6 Cr.P.C., which includes the Courts of Sessions, Judicial Magistrates, Metropolitan Magistrates as well as Executive Magistrates. The Court of Sessions is defined in Section 9 Cr.P.C. and the Courts of Judicial Magistrates has been defined under Section 11 thereof. The Courts of Metropolitan Magistrates has been defined under Section 16 Cr.P.C. The courts which can try offences committed under the Indian Penal Code, 1860 or any offence under any other law, have been specified under Section 26 Cr.P.C. read with First Schedule. The explanatory note (2) under the heading of ?Classification of Offences? under the First Schedule specifies the expression ?magistrate of first class? and ?any magistrate? to include Metropolitan Magistrates who are empowered to try the offences under the said Schedule but excludes Executive Magistrates. 14. It is at this stage the comparison of the words used under Section 319 Cr.P.C. has to be understood distinctively from the word used under Section 2(g) defining an inquiry other than the trial by a magistrate or a court. Here the legislature has used two words, namely the magistrate or court, whereas under Section 319 Cr.P.C., as indicated above, only the word ?court? has been recited. This has been done by the legislature to emphasise that the power under Section 319 Cr.P.C. is exercisable only by the court and not by any officer not acting as a court. Thus, the magistrate not functioning or exercising powers as a court can make an inquiry in particular proceeding other than a trial but the material so collected would not be by a court during the course of an inquiry or a trial. The conclusion therefore, in short, is that in order to invoke the power under Section 319 Cr.P.C., it is only a Court of Sessions or a Court of Magistrate performing the duties as a court under the Cr.P.C. that can utilise the material before it for the purpose of the said Section. 15. Section 319 Cr.P.C. allows the court to proceed against any person who is not an accused in a case before it. Thus, the person against whom summons are issued in exercise of such powers, has to necessarily not be an accused already facing trial. He can either be a person named in Column 2 of the chargesheet filed under Section 173 Cr.P.C. or a person whose name has been disclosed in any material before the court that is to be considered for the purpose of trying the offence, but not investigated. He has to be a person whose complicity may be indicated and connected with the commission of the offence. 16. The legislature cannot be presumed to have imagined all the circumstances and, therefore, it is the duty of the court to give full effect to the words used by the legislature so as to encompass any situation which the court may have to tackle while proceeding to try an offence and not allow a person who deserves to be tried to go scot free by being not arraigned in the trial in spite of possibility of his complicity which can be gathered from the documents presented by the prosecution. 17. The court is the sole repository of justice and a duty is cast upon it to uphold the rule of law and, therefore, it will be inappropriate to deny the existence of such powers with the courts in our criminal justice system where it is not uncommon that the real accused, at times, get away by manipulating the investigating and/or the prosecuting agency. The desire to avoid trial is so strong that an accused makes efforts at times to get himself absolved even at the stage of investigation or inquiry even though he may be connected with the commission of the offence. 18. Coming to the stage at which power under Section 319 Cr.P.C. can be exercised, in Dharam Pal (Supra), this Court had noticed the conflict in the decisions of Kishun Singh & Ors v. State of Bihar, (1993) 2 SCC 16 and Ranjit Singh v. State of Punjab, AIR 1998 SC 3148, and referred the matter to the Constitution Bench. However, while referring the matter to a Constitution Bench, this Court affirmed the judgment in Kishun Singh (Supra) and doubted the correctness of the judgment in Ranjit Singh (Supra). In Ranjit Singh (Supra), this Court observed that from the stage of committal till the Sessions Court reaches the stage indicated in Section 230 Cr.P.C., that court can deal with only the accused referred to in Section 209 Cr.P.C. and there is no intermediary stage till then for the Sessions Court to add any other person to the array of the accused, while in Kishun Singh (Supra), this Court came to the conclusion that even the Sessions Court has power under Section 193 Cr.P.C. to take cognizance of the offence and summon other persons whose complicity in the commission of the trial can prima facie be gathered from the materials available on record and need not wait till the stage of Section 319 Cr.P.C. is reached. This Court in Dharam Pal (Supra) held that the effect of Ranjit Singh (Supra) would be that in less serious offences triable by a Magistrate, the said Court would have the power to proceed against those who are mentioned in Column 2 of the charge-sheet, if on the basis of material on record, the Magistrate disagrees with the conclusion reached by the police, but, as far as serious offences triable by the Court of Sessions are concerned, that court will have to wait till the stage of Section 319 Cr.P.C. is reached. 19. At the very outset, we may explain that the issue that was being considered by this Court in Dharam Pal (CB), was the exercise of such power at the stage of committal of a case and the court held that even if Section 319 Cr.P.C. could not be invoked at that stage, Section 193 Cr.P.C. could be invoked for the said purpose. We are not delving into the said issue which had been answered by the five-Judge Bench of this Court. However, we may clarify that the opening words of Section 193 Cr.P.C. categorically recite that the power of the Court of Sessions to take cognizance would commence only after committal of the case by a magistrate. The said provision opens with a non-obstante clause ?except as otherwise expressly provided by this code or by any other law for the time being in force?. The Section therefore is clarified by the said opening words which clearly means that if there is any other provision under Cr.P.C., expressly making a provision for exercise of powers by the court to take cognizance, then the same would apply and the provisions of Section 193 Cr.P.C. would not be applicable. 20. In our opinion, Section 319 Cr.P.C. is an enabling provision empowering the court to take appropriate steps for proceeding against any person not being an accused for also having committed the offence under trial. It is this part which is under reference before this Court and therefore in our opinion, while answering the question referred to herein, we do not find any conflict so as to delve upon the situation that was dealt by this Court in Dharam Pal (CB). 21. In Elachuri Venkatachinnayya & Ors. v. King-Emperor (1920) ILR 43 Mad 511, this Court held that an inquiry is a stage before the committal to a higher court. In fact, from a careful reading of the judgments under reference i.e. Ranjit Singh (Supra) and Kishun Singh (Supra), it emerges that there is no dispute even in these two cases that the stage of committal is neither an inquiry nor a trial, for in both the cases, the real dispute was whether Section 193 Cr.P.C. can be invoked at the time of committal to summon an accused to face trial who is not already an accused. It can safely be said that both the cases are in harmony as to the said stage neither being a stage of inquiry nor a trial. 22. Once the aforesaid stand is clarified in relation to the stage of committal before the Court of Sessions, the answer to the question posed now, stands focussed only on the stage at which such powers can be exercised by the court other than the stage of committal and the material on the basis whereof such powers can be invoked by the court. Question No.(i) What is the stage at which power under Section 319 Cr.P.C. can be exercised? 23. The stage of inquiry and trial upon cognizance being taken of an offence, has been considered by a large number of decisions of this Court and that it may be useful to extract the same hereunder for proper appreciation of the stage of invoking of the powers under Section 319 Cr.P.C. to understand the meaning that can be attributed to the word ?inquiry? and ?trial? as used under the Section. 24. In Raghubans Dubey v. State of Bihar, AIR 1967 SC 1167, this Court held : ??once cognizance has been taken by the Magistrate, he takes cognizance of an offence and not the offenders; once he takes cognizance of an offence it is his duty to find out who the offenders really are and once he comes to the conclusion that apart from the persons sent up by the police some other persons are involved, it is his duty to proceed against those persons. The summoning of the additional accused is part of the proceeding initiated by his taking cognizance of an offence.? 25. The stage of inquiry commences, insofar as the court is concerned, with the filing of the charge-sheet and the consideration of the material collected by the prosecution, that is mentioned in the charge-sheet for the purpose of trying the accused. This has to be understood in terms of Section 2(g) Cr.P.C., which defines an inquiry as follows: ?2(g) ?inquiry? means every inquiry, other than a trial, conducted under this Code by a Magistrate or Court.? 26. In State of U.P. v. Lakshmi Brahman & Anr., AIR 1983 SC 439, this Court held that from the stage of filing of charge-sheet to ensuring the compliance of provision of Section 207 Cr.P.C., the court is only at the stage of inquiry and no trial can be said to have commenced. The above view has been held to be per incurium in Raj Kishore Prasad v. State of Bihar & Anr., AIR 1996 SC 1931, wherein this Court while observing that Section 319 (1) Cr.P.C. operates in an ongoing inquiry into, or trial of, an offence, held that at the stage of Section 209 Cr.P.C., the court is neither at the stage of inquiry nor at the stage of trial. Even at the stage of ensuring compliance of Sections 207 and 208 Cr.P.C., it cannot be said that the court is at the stage of inquiry because there is no judicial application of mind and all that the Magistrate is required to do is to make the case ready to be heard by the Court of Sessions. 27. Trial is distinct from an inquiry and must necessarily succeed it. The purpose of the trial is to fasten the responsibility upon a person on the basis of facts presented and evidence led in this behalf. In Moly & Anr. v. State of Kerala, AIR 2004 SC 1890, this Court observed that though the word ?trial? is not defined in the Code, it is clearly distinguishable from inquiry. Inquiry must always be a forerunner to the trial. A three-Judge Bench of this Court in The State of Bihar v. Ram Naresh Pandey & Anr., AIR 1957 SC 389 held: ?The words 'tried' and 'trial' appear to have no fixed or universal meaning. No doubt, in quite a number of sections in the Code to which our attention has been drawn the words 'tried' and 'trial' have been used in the sense of reference to a stage after the inquiry. That meaning attaches to the words in those sections having regard to the context in which they are used. There is no reason why where these words are used in another context in the Code, they should necessarily be limited in their connotation and significance. They are words which must be considered with regard to the particular context in which they are used and with regard to the scheme and purpose of the provision under consideration.? (Emphasis added) 28. In Ratilal Bhanji Mithani v. State of Maharashtra & Ors., AIR 1979 SC 94, this Court held : ?Once a charge is framed, the Magistrate has no power under Section 227 or any other provision of the Code to cancel the charge, and reverse the proceedings to the stage of Section 253 and discharge the accused. The trial in a warrant case starts with the framing of charge; prior to it the proceedings are only an inquiry. After the framing of charge if the accused pleads not guilty, the Magistrate is required to proceed with the trial in the manner provided in Sections 254 to 258 to a logical end.? (Emphasis added) 29. In V.C. Shukla v. State through C.B.I., AIR 1980 SC 962, this Court held: ??The proceedings starting with Section 238 of the Code including any discharge or framing of charges under Section 239 or 240 amount to a trial?? 30. In Union of India & Ors. v. Major General Madan Lal Yadav (Retd.), AIR 1996 SC 1340, a three-Judge Bench while dealing with the proceedings in General Court Martial under the provisions of the Army Act 1950, applied legal maxim ?nullus commodum capere potest de injuria sua propria? (no one can take advantage of his own wrong), and referred to various dictionary meanings of the word ?trial? and came to the conclusion: ?It would, therefore, be clear that trial means act of proving or judicial examination or determination of the issues including its own jurisdiction or authority in accordance with law or adjudging guilt or innocence of the accused including all steps necessary thereto. The trial commences with the performance of the first act or steps necessary or essential to proceed with the trial. (Emphasis supplied) X X X X Our conclusion further gets fortified by the scheme of the trial of a criminal case under the Code of Criminal Procedure, 1973, viz., Chapter XIV ?Conditions requisite for initiation of proceedings? containing Sections 190 to 210, Chapter XVIII containing Sections 225 to 235 and dealing with ?trial before a Court of Sessions? pursuant to committal order under Section 209 and in Chapter XIX ?trial of warrant cases by Magistrates? containing Sections 238 to 250 etc. It is settled law that under the said Code trial commences the moment cognizance of the offence is taken and process is issued to the accused for his appearance etc. Equally, at a sessions trial, the court considers the committal order under Section 209 by the Magistrate and proceeds further. It takes cognizance of the offence from that stage and proceeds with the trial. The trial begins with the taking of the cognizance of the offence and taking further steps to conduct the trial.? (Emphasis supplied) 31. In ?Common Cause?, A Registered Society thr. its Director v. Union of India & Ors., AIR 1997 SC 1539, this Court while dealing with the issue held: ?(i) In case of trials before Sessions Court the trials shall be treated to have commenced when charges are framed under Section 228 of the Code of Criminal Procedure, 1973 in the concerned cases. ii) In cases of trials of warrant cases by Magistrates if the cases are instituted upon police reports the trials shall be treated to have commenced when charges are framed under Section 240 of the Code of Criminal Procedure, 1973, while in trials of warrant cases by Magistrates when cases are instituted otherwise than on police report such trials shall be treated to have commenced when charges are framed against the concerned accused under Section 246 of the Code of Criminal Procedure, 1973. iii) In cases of trials of summons cases by Magistrates the trials would be considered to have commenced when the accused who appear or are brought before the Magistrate are asked under Section 251 whether they plead guilty or have any defence to make.? (Emphasis added) 32. In Raj Kishore Prasad (Supra), this Court said that as soon as the prosecutor is present before the court and that court hears the parties on framing of charges and discharge, trial is said to have commenced and that there is no intermediate stage between committal of case and framing of charge. 33. In In Re: Narayanaswamy Naidu v. Unknown 1 Ind Cas 228, a Full Bench of the Madras High Court held that ?Trial begins when the accused is charged and called on to answer and then the question before the Court is whether the accused is to be acquitted or convicted and not whether the complaint is to be dismissed or the accused discharged.? A similar view has been taken by Madras High Court subsequently in Sriramulu v. Veerasalingam, (1914) I.L.R. 38 Mad. 585. 34. However, the Bombay High Court in Dagdu Govindshet Wani v. Punja Vedu Wani (1936) 38 Bom.L.R. 1189 referring to Sriramulu (Supra) held : ?There is no doubt that the Court did take the view that in a warrant case the trial only commences from the framing of the charge ?..But, according to my experience of the administration of criminal justice in this Presidency, which is not inconsiderable, the Courts here have always accepted the definition of trial which has been given in Gomer Sirda v. Queen- Empress, (1898) I.L.R. 25 Cal. 863, that is to say, trial has always been understood to mean the proceeding which commences when the case is called on with the Magistrate on the Bench, the accused in the dock and the representatives of the prosecution and, defence, if the accused be defended, present in Court for the hearing of the case.? A similar view has been taken by the Lahore High Court in Sahib Din v. The Crown, (1922) I.L.R. 3 Lah. 115, wherein it was held that for the purposes of Section 350 of the Code, a trial cannot be said to commence only when a charge is framed. The trial covers the whole of the proceedings in a warrant case. This case was followed in Fakhruddin v. The Crown, (1924) I.L.R. 6 Lah. 176; and in Labhsing v. Emperor, (1934) 35 Cr.L. J. 1261. 35. In view of the above, the law can be summarised to the effect that as ?trial? means determination of issues adjudging the guilt or the innocence of a person, the person has to be aware of what is the case against him and it is only at the stage of framing of the charges that the court informs him of the same, the ?trial? commences only on charges being framed. Thus, we do not approve the view taken by the courts that in a criminal case, trial commences on cognizance being taken. 36. Section 2(g) Cr.P.C. and the case laws referred to above, therefore, clearly envisage inquiry before the actual commencement of the trial, and is an act conducted under Cr.P.C. by the Magistrate or the court. The word ?inquiry? is, therefore, not any inquiry relating to the investigation of the case by the investigating agency but is an inquiry after the case is brought to the notice of the court on the filing of the charge-sheet. The court can thereafter proceed to make inquiries and it is for this reason that an inquiry has been given to mean something other than the actual trial. 37. Even the word ?course? occurring in Section 319 Cr.P.C., clearly indicates that the power can be exercised only during the period when the inquiry has been commenced and is going on or the trial which has commenced and is going on. It covers the entire wide range of the process of the pre-trial and the trial stage. The word ?course? therefore, allows the court to invoke this power to proceed against any person from the initial stage of inquiry upto the stage of the conclusion of the trial. The court does not become functus officio even if cognizance is taken so far as it is looking into the material qua any other person who is not an accused. The word ?course? ordinarily conveys a meaning of a continuous progress from one point to the next in time and conveys the idea of a period of time; duration and not a fixed point of time. (See: Commissioner of Income-tax, New Delhi (Now Rajasthan) v. M/s. East West Import & Export (P) Ltd. (Now known as Asian Distributors Ltd.) Jaipur, AIR 1989 SC 836). 38. In a somewhat similar manner, it has been attributed to word ?course? the meaning of being a gradual and continuous flow advanced by journey or passage from one place to another with reference to period of time when the movement is in progress. (See: State of Travancore-Cochin & Ors. v. Shanmugha Vilas Cashewnut Factory, Quilon, AIR 1953 SC 333). 39. To say that powers under Section 319 Cr.P.C. can be exercised only during trial would be reducing the impact of the word ?inquiry? by the court. It is a settled principle of law that an interpretation which leads to the conclusion that a word used by the legislature is redundant, should be avoided as the presumption is that the legislature has deliberately and consciously used the words for carrying out the purpose of the Act. The legal maxim \"A Verbis Legis Non Est Recedendum\" which means, \"from the words of law, there must be no departure\" has to be kept in mind. 40. The court cannot proceed with an assumption that the legislature enacting the statute has committed a mistake and where the language of the statute is plain and unambiguous, the court cannot go behind the language of the statute so as to add or subtract a word playing the role of a political reformer or of a wise counsel to the legislature. The court has to proceed on the footing that the legislature intended what it has said and even if there is some defect in the phraseology etc., it is for others than the court to remedy that defect. The statute requires to be interpreted without doing any violence to the language used therein. The court cannot re-write, recast or reframe the legislation for the reason that it has no power to legislate. 41. No word in a statute has to be construed as surplusage. No word can be rendered ineffective or purposeless. Courts are required to carry out the legislative intent fully and completely. While construing a provision, full effect is to be given to the language used therein, giving reference to the context and other provisions of the Statute. By construction, a provision should not be reduced to a ?dead letter? or ?useless lumber?. An interpretation which renders a provision an otiose should be avoided otherwise it would mean that in enacting such a provision, the legislature was involved in ?an exercise in futility? and the product came as a ?purposeless piece? of legislation and that the provision had been enacted without any purpose and the entire exercise to enact such a provision was ?most unwarranted besides being uncharitable.? (Vide: Patel Chunibhai Dajibha etc. v. Narayanrao Khanderao Jambekar & Anr., AIR 1965 SC 1457; The Martin Burn Ltd. v. The Corporation of Calcutta, AIR 1966 SC 529; M.V. Elisabeth & Ors. v. Harwan Investment & Trading Pvt. Ltd. Hanoekar House, Swatontapeth, Vasco-De-Gama, Goa, AIR 1993 SC 1014; Sultana Begum v. Prem Chand Jain, AIR 1997 SC 1006; State of Bihar & Ors. etc.etc. v. Bihar Distillery Ltd. etc. etc., AIR 1997 SC 1511; Institute of Chartered Accountants of India v. M/s. Price Waterhouse & Anr., AIR 1998 SC 74; and The South Central Railway Employees Co- operative Credit Society Employees Union, Secundrabad v. The Registrar of Co-operative Societies & Ors., AIR 1998 SC 703). 42. This Court in Rohitash Kumar & Ors. v. Om Prakash Sharma & Ors., AIR 2013 SC 30, after placing reliance on various earlier judgments of this Court held: ?The Court has to keep in mind the fact that, while interpreting the provisions of a Statute, it can neither add, nor subtract even a single word? A section is to be interpreted by reading all of its parts together, and it is not permissible, to omit any part thereof. The Court cannot proceed with the assumption that the legislature, while enacting the Statute has committed a mistake; it must proceed on the footing that the legislature intended what it has said; even if there is some defect in the phraseology used by it in framing the statute, and it is not open to the court to add and amend, or by construction, make up for the deficiencies, which have been left in the Act??The Statute is not to be construed in light of certain notions that the legislature might have had in mind, or what the legislature is expected to have said, or what the legislature might have done, or what the duty of the legislature to have said or done was. The Courts have to administer the law as they find it, and it is not permissible for the Court to twist the clear language of the enactment, in order to avoid any real, or imaginary hardship which such literal interpretation may cause??.under the garb of interpreting the provision, the Court does not have the power to add or subtract even a single word, as it would not amount to interpretation, but legislation.? Thus, by no means it can be said that provisions of Section 319 Cr.P.C. cannot be pressed into service during the course of ?inquiry?. The word ?inquiry? is not surpulsage in the said provision. 43. Since after the filing of the charge-sheet, the court reaches the stage of inquiry and as soon as the court frames the charges, the trial commences, and therefore, the power under Section 319(1) Cr.P.C. can be exercised at any time after the charge-sheet is filed and before the pronouncement of judgment, except during the stage of Section 207/208 Cr.P.C., committal etc., which is only a pre-trial stage, intended to put the process into motion. This stage cannot be said to be a judicial step in the true sense for it only requires an application of mind rather than a judicial application of mind. 44. At this pre-trial stage, the Magistrate is required to perform acts in the nature of administrative work rather than judicial such as ensuring compliance of Sections 207 and 208 Cr.P.C., and committing the matter if it is exclusively triable by Sessions Court. Therefore, it would be legitimate for us to conclude that the Magistrate at the stage of Sections 207 to 209 Cr.P.C. is forbidden, by express provision of Section 319 Cr.P.C., to apply his mind to the merits of the case and determine as to whether any accused needs to be added or subtracted to face trial before the Court of Sessions. 45. It may be pertinent to refer to the decision in the case of Raj Kishore Prasad (supra) where, in order to avoid any delay in trial, the court emphasised that such a power should be exercised keeping in view the context in which the words ?inquiry? and ?trial? have been used under Section 319 Cr.P.C. and came to the conclusion that such a power is not available at the pre-trial stage and should be invoked only at the stage of inquiry or after evidence is recorded. 46. A two-Judge Bench of this Court in M/s. SWIL Ltd. v. State of Delhi & Anr., AIR 2001 SC 2747, held that once the process has been issued, power under Section 319 Cr.P.C. cannot be exercised as at that stage, since it is neither an inquiry nor a trial. In Ranjit Singh (Supra), the Court held : ?So from the stage of committal till the Sessions Court reaches the stage indicated in Section 230 of the Code, that court can deal with only the accused referred to in Section 209 of the Code. There is no intermediary stage till then for the Sessions Court to add any other person to the array of the accused. Thus, once the Sessions Court takes cognizance of the offence pursuant to the committal order, the only other stage when the court is empowered to add any other person to the array of the accused is after reaching evidence collection when powers under Section 319 of the Code can be invoked? 47. In Kishun Singh (Supra), the Court while considering the provision of the old Code, the Law Commission?s Recommendation and the provisions in the Cr.P.C., held that Section 319 Cr.P.C. is an improved provision upon the earlier one. It has removed the difficulty of taking cognizance as cognizance against the added person would be deemed to have been taken as originally against the other co-accused. Therefore, on Magistrate committing the case under Section 209 Cr.P.C. to the Court of Sessions, the bar of Section 193 Cr.P.C. gets lifted thereby investing the Court of Sessions complete and unfettered jurisdiction of the court of original jurisdiction to take cognizance of the offence which would include the summoning of the person or persons whose complicity in the commission of the crime can prima facie be gathered from the material available on record, though who is not an accused before the court. 48. In Dharam Pal (CB), the Constitution Bench approved the decision in Kishun Singh (Supra) that the Sessions Judge has original power to summon accused holding that ?the Sessions Judge was entitled to issue summons under Section 193 Code of Criminal Procedure upon the case being committed to him by the Magistrate. The key words in Section 193 are that \"no Court of Session shall take cognizance of any offence as a Court of original jurisdiction unless the case has been committed to it by a Magistrate under this Code.\" The above provision entails that a case must, first of all, be committed to the Court of Session by the Magistrate. The second condition is that only after the case had been committed to it, could the Court of Session take cognizance of the offence exercising original jurisdiction. Although, an attempt has been made to suggest that the cognizance indicated in Section 193 deals not with cognizance of an offence, but of the commitment order passed by the learned Magistrate, we are not inclined to accept such a submission in the clear wordings of Section 193 that the Court of Session may take cognizance of the offences under the said Section? 49. It is thus aptly clear that until and unless the case reaches the stage of inquiry or trial by the court, the power under Section 319 Cr.P.C. cannot be exercised. In fact, this proposition does not seem to have been disturbed by the Constitution Bench in Dharam Pal (CB). The dispute therein was resolved visualizing a situation wherein the court was concerned with procedural delay and was of the opinion that the Sessions Court should not necessarily wait till the stage of Section 319 Cr.P.C. is reached to direct a person, not facing trial, to appear and face trial as an accused. We are in full agreement with the interpretation given by the Constitution Bench that Section 193 Cr.P.C. confers power of original jurisdiction upon the Sessions Court to add an accused once the case has been committed to it. 50. In our opinion, the stage of inquiry does not contemplate any evidence in its strict legal sense, nor the legislature could have contemplated this inasmuch as the stage for evidence has not yet arrived. The only material that the court has before it is the material collected by the prosecution and the court at this stage prima facie can apply its mind to find out as to whether a person, who can be an accused, has been erroneously omitted from being arraigned or has been deliberately excluded by the prosecuting agencies. This is all the more necessary in order to ensure that the investigating and the prosecuting agencies have acted fairly in bringing before the court those persons who deserve to be tried and to prevent any person from being deliberately shielded when they ought to have been tried. This is necessary to usher faith in the judicial system whereby the court should be empowered to exercise such powers even at the stage of inquiry and it is for this reason that the legislature has consciously used separate terms, namely, inquiry or trial in Section 319 Cr.P.C. Accordingly, we hold that the court can exercise the power under Section 319 Cr.P.C. only after the trial proceeds and commences with the recording of the evidence and also in exceptional circumstances as explained herein above. 51. There is yet another set of provisions which form part of inquiry relevant for the purposes of Section 319 Cr.P.C. i.e. provisions of Sections 200, 201, 202, etc. Cr.P.C. applicable in the case of Complaint Cases. As has been discussed herein, evidence means evidence adduced before the court. Complaint Cases is a distinct category of criminal trial where some sort of evidence in the strict legal sense of Section 3 of the Evidence Act 1872, (hereinafter referred to as the ?Evidence Act?) comes before the court. There does not seem to be any restriction in the provisions of Section 319 Cr.P.C. so as to preclude such evidence as coming before the court in Complaint Cases even before charges have been framed or the process has been issued. But at that stage as there is no accused before the Court, such evidence can be used only to corroborate the evidence recorded during the trial for the purpose of Section 319 Cr.P.C., if so required. 52. What is essential for the purpose of the section is that there should appear some evidence against a person not proceeded against and the stage of the proceedings is irrelevant. Where the complainant is circumspect in proceeding against several persons, but the court is of the opinion that there appears to be some evidence pointing to the complicity of some other persons as well, Section 319 Cr.P.C. acts as an empowering provision enabling the court/Magistrate to initiate proceedings against such other persons. The purpose of Section 319 Cr.P.C. is to do complete justice and to ensure that persons who ought to have been tried as well are also tried. Therefore, there does not appear to be any difficulty in invoking powers of Section 319 Cr.P.C. at the stage of trial in a complaint case when the evidence of the complainant as well as his witnesses is being recorded. 53. Thus, the application of the provisions of Section 319 Cr.P.C., at the stage of inquiry is to be understood in its correct perspective. The power under Section 319 Cr.P.C. can be exercised only on the basis of the evidence adduced before the court during a trial. So far as its application during the course of inquiry is concerned, it remains limited as referred to hereinabove, adding a person as an accused, whose name has been mentioned in Column 2 of the charge sheet or any other person who might be an accomplice. Question No.(iii) : Whether the word \"evidence\" used in Section 319(1) Cr.P.C. has been used in a comprehensive sense and includes the evidence collected during investigation or the word \"evidence\" is limited to the evidence recorded during trial? 54. To answer the questions and to resolve the impediment that is being faced by the trial courts in exercising of powers under Section 319 Cr.P.C., the issue has to be investigated by examining the circumstances which give rise to a situation for the court to invoke such powers. The circumstances that lead to such inference being drawn up by the court for summoning a person arise out of the availability of the facts and material that comes up before the court and are made the basis for summoning such a person as an accomplice to the offence alleged to have been committed. The material should disclose the complicity of the person in the commission of the offence which has to be the material that appears from the evidence during the course of any inquiry into or trial of offence. The words as used in Section 319 Cr.P.C. indicate that the material has to be ?where ?.it appears from the evidence? before the court. 55. Before we answer this issue, let us examine the meaning of the word ?evidence?. According to Section 3 of the Evidence Act, ?evidence? means and includes: (1) all statements which the Court permits or requires to be made before it by witnesses, in relation to matters of fact under inquiry; such statements are called oral evidence; (2) all documents including electronic records produced for the inspection of the Court, such statements are called documentary evidence; 56. According to Tomlin?s Law Dictionary, Evidence is ?the means from which an inference may logically be drawn as to the existence of a fact. It consists of proof by testimony of witnesses, on oath; or by writing or records.? Bentham defines ?evidence? as ?any matter of fact, the effect, tendency or design of which presented to mind, is to produce in the mind a persuasion concerning the existence of some other matter of fact- a persuasion either affirmative or disaffirmative of its existence. Of the two facts so connected, the latter may be distinguished as the principal fact, and the former as the evidentiary fact.? According to Wigmore on Evidence, evidence represents ?any knowable fact or group of facts, not a legal or a logical principle, considered with a view to its being offered before a legal tribunal for the purpose of producing a persuasion, positive or negative, on the part of the tribunal, as to the truth of a proposition, not of law, or of logic, on which the determination of the tribunal is to be asked.? 57. The provision and the above-mentioned definitions clearly suggest that it is an exhaustive definition. Wherever the words ?means and include? are used, it is an indication of the fact that the definition ?is a hard and fast definition?, and no other meaning can be assigned to the expression that is put down in the definition. It indicates an exhaustive explanation of the meaning which, for the purposes of the Act, must invariably be attached to these words or expression. (Vide: M/s. Mahalakshmi Oil Mills v. State of A.P., AIR 1989 SC 335; Punjab Land Development and Reclamation Corporation Ltd., Chandigarh v. Presiding Officer, Labour Court, Chandigarh & Ors., (1990) 3 SCC 682; P. Kasilingam & Ors. v. P.S.G. College of Technology & Ors., AIR 1995 SC 1395; Hamdard (Wakf) Laboratories v. Dy. Labour Commissioner & Ors., AIR 2008 SC 968; and Ponds India Ltd. (merged with H.L. Limited) v. Commissioner of Trade Tax, Lucknow, (2008) 8 SCC 369). 58. In Feroze N. Dotivala v. P.M. Wadhwani & Ors., (2003) 1 SCC 433, dealing with a similar issue, this Court observed as under: ?Generally, ordinary meaning is to be assigned to any word or phrase used or defined in a statute. Therefore, unless there is any vagueness or ambiguity, no occasion will arise to interpret the term in a manner which may add something to the meaning of the word which ordinarily does not so mean by the definition itself, more particularly, where it is a restrictive definition. Unless there are compelling reasons to do so, meaning of a restrictive and exhaustive definition would not be expanded or made extensive to embrace things which are strictly not within the meaning of the word as defined.? We, therefore proceed to examine the matter further on the premise that the definition of word ?evidence? under the Evidence Act is exhaustive. 59. In Kalyan Kumar Gogoi v. Ashutosh Agnihotri & Anr., AIR 2011 SC 760, while dealing with the issue this Court held : ?18. The word ?evidence? is used in common parlance in three different senses: (a) as equivalent to relevant, (b) as equivalent to proof, and (c) as equivalent to the material, on the basis of which courts come to a conclusion about the existence or non-existence of disputed facts. Though, in the definition of the word ?evidence? given in Section 3 of the Evidence Act one finds only oral and documentary evidence, this word is also used in phrases such as best evidence, circumstantial evidence, corroborative evidence, derivative evidence, direct evidence, documentary evidence, hearsay evidence, indirect evidence, oral evidence, original evidence, presumptive evidence, primary evidence, real evidence, secondary evidence, substantive evidence, testimonial evidence, etc.? 60. In relation to a Civil Case, this court in Ameer Trading Corporation Ltd. v. Shapoorji Data Processing Ltd., AIR 2004 SC 355, held that the examination of a witness would include evidence-in- chief, cross-examination or re-examination. In Omkar Namdeo Jadhao & Ors v. Second Additional Sessions Judge Buldana & Anr., AIR 1997 SC 331; and Ram Swaroop & Ors. v. State of Rajasthan, AIR 2004 SC 2943, this Court held that statements recorded under Section 161 Cr.P.C. during the investigation are not evidence. Such statements can be used at the trial only for contradictions or omissions when the witness is examined in the court. (See also: Podda Narayana & Ors. v. State of A.P., AIR 1975 SC 1252; Sat Paul v. Delhi Administration, AIR 1976 SC 294; and State (Delhi Administration) v. Laxman Kumar & Ors., AIR 1986 SC 250). 61. In Lok Ram v. Nihal Singh & Anr., AIR 2006 SC 1892, it was held that it is evident that a person, even though had initially been named in the FIR as an accused, but not charge-sheeted, can also be added as an accused to face the trial. The trial court can take such a step to add such persons as accused only on the basis of evidence adduced before it and not on the basis of materials available in the charge- sheet or the case diary, because such materials contained in the charge-sheet or the case diary do not constitute evidence. 62. The majority view of the Constitution Bench in Ramnarayan Mor & Anr. v. The State of Maharashtra, AIR 1964 SC 949 has been as under: ?9. It was urged in the alternative by counsel for the appellants that even if the expression ?evidence? may include documents, such documents would only be those which are duly proved at the enquiry for commitment, because what may be used in a trial, civil or criminal, to support the judgment of a Court is evidence duly proved according to law. But by the Evidence Act which applies to the trial of all criminal cases, the expression ?evidence? is defined in Section 3 as meaning and including all statements which the Court permits or requires to be made before it by witnesses, in relation to matters of fact under enquiry and documents produced for the inspection of the Court. There is no restriction in this definition to documents which are duly proved by evidence.? (Emphasis added) 63. Similarly, this Court in Sunil Mehta & Anr. v. State of Gujarat & Anr., JT 2013 (3) SC 328, held that ?It is trite that evidence within the meaning of the Evidence Act and so also within the meaning of Section 244 of the Cr.P.C. is what is recorded in the manner stipulated under Section 138 in the case of oral evidence. Documentary evidence would similarly be evidence only if the documents are proved in the manner recognised and provided for under the Evidence Act unless of course a statutory provision makes the document admissible as evidence without any formal proof thereof.? 64. In Guriya @ Tabassum Tauquir & Ors. v. State of Bihar & Anr., AIR 2008 SC 95, this Court held that in exercise of the powers under Section 319 Cr.P.C., the court can add a new accused only on the basis of evidence adduced before it and not on the basis of materials available in the charge sheet or the case diary. 65. In Kishun Singh (Supra), this Court held : ?11. On a plain reading of sub-section (1) of Section 319 there can be no doubt that it must appear from the evidence tendered in the course of any inquiry or trial that any person not being the accused has committed any offence for which he could be tried together with the accused. This power (under Section 319(1)), it seems clear to us, can be exercised only if it so appears from the evidence at the trial and not otherwise. Therefore, this sub-section contemplates existence of some evidence appearing in the course of trial wherefrom the court can prima facie conclude that the person not arraigned before it is also involved in the commission of the crime for which he can be tried with those already named by the police. Even a person who has earlier been discharged would fall within the sweep of the power conferred by S. 319 of the Code. Therefore, stricto sensu, Section 319 of the Code cannot be invoked in a case like the present one where no evidence has been led at a trial wherefrom it can be said that the appellants appear to have been involved in the commission of the crime along with those already sent up for trial by the prosecution. 12. But then it must be conceded that Section 319 covers the post-cognizance stage where in the course of an inquiry or trial the involvement or complicity of a person or persons not named by the investigating agency has surfaced which necessitates the exercise of the discretionary power conferred by the said provision?..? 66. A similar view has been taken by this Court in Raj Kishore Prasad (Supra), wherein it was held that in order to apply Section 319 Cr.P.C., it is essential that the need to proceed against the person other than the accused appearing to be guilty of offence arises only on evidence recorded in the course of an inquiry or trial. 67. In Lal Suraj @ Suraj Singh & Anr. v. State of Jharkhand, (2009) 2 SCC 696, a two-Judge Bench of this Court held that ?a court framing a charge would have before it all the materials on record which were required to be proved by the prosecution. In a case where, however, the court exercises its jurisdiction under Section 319 Cr.P.C., the power has to be exercised on the basis of the fresh evidence brought before the court. There lies a fine but clear distinction.? 68. A similar view has been reiterated by this Court in Rajendra Singh v. State of U.P. & Anr., AIR 2007 SC 2786, observing that court should not exercise the power under Section 319 Cr.P.C. on the basis of materials available in the charge-sheet or the case diary, because such materials contained in the charge-sheet or the case diary do not constitute evidence. The word ?evidence? in Section 319 Cr.P.C. contemplates the evidence of witnesses given in the court. 69. Ordinarily, it is only after the charges are framed that the stage of recording of evidence is reached. A bare perusal of Section 227 Cr.P.C. would show that the legislature has used the terms ?record of the case? and the ?documents submitted therewith?. It is in this context that the word ?evidence? as appearing in Section 319 Cr.P.C. has to be read and understood. The material collected at the stage of investigation can at best be used for a limited purpose as provided under Section 157 of the Evidence Act i.e. to corroborate or contradict the statements of the witnesses recorded before the court. Therefore, for the exercise of power under Section 319 Cr.P.C., the use of word `evidence? means material that has come before the court during an inquiry or trial by it and not otherwise. If from the evidence led in the trial the court is of the opinion that a person not accused before it has also committed the offence, it may summon such person under Section 319 Cr.P.C. 70. With respect to documentary evidence, it is sufficient, as can be seen from a bare perusal of Section 3 of the Evidence Act as well as the decision of the Constitution Bench, that a document is required to be produced and proved according to law to be called evidence. Whether such evidence is relevant, irrelevant, admissible or inadmissible, is a matter of trial. 71. It is, therefore, clear that the word ?evidence? in Section 319 Cr.P.C. means only such evidence as is made before the court, in relation to statements, and as produced before the court, in relation to documents. It is only such evidence that can be taken into account by the Magistrate or the Court to decide whether power under Section 319 Cr.P.C. is to be exercised and not on the basis of material collected during investigation. 72. The inquiry by the court is neither attributable to the investigation nor the prosecution, but by the court itself for collecting information to draw back a curtain that hides something material. It is the duty of the court to do so and therefore the power to perform this duty is provided under the Cr.P.C. 73. The unveiling of facts other than the material collected during investigation before the magistrate or court before trial actually commences is part of the process of inquiry. Such facts when recorded during trial are evidence. It is evidence only on the basis whereof trial can be held, but can the same definition be extended for any other material collected during inquiry by the magistrate or court for the purpose of Section 319 Cr.P.C.? 74. An inquiry can be conducted by the magistrate or court at any stage during the proceedings before the court. This power is preserved with the court and has to be read and understood accordingly. The outcome of any such exercise should not be an impediment in the speedy trial of the case. 75. Though the facts so received by the magistrate or the court may not be evidence, yet it is some material that makes things clear and unfolds concealed or deliberately suppressed material that may facilitate the trial. In the context of Section 319 Cr.P.C. it is an information of complicity. Such material therefore, can be used even though not an evidence in stricto sensuo, but an information on record collected by the court during inquiry itself, as a prima facie satisfaction for exercising the powers as presently involved. 76. This pre-trial stage is a stage where no adjudication on the evidence of the offences involved takes place and therefore, after the material alongwith the charge-sheet has been brought before the court, the same can be inquired into in order to effectively proceed with framing of charges. After the charges are framed, the prosecution is asked to lead evidence and till that is done, there is no evidence available in the strict legal sense of Section 3 of the Evidence Act. The actual trial of the offence by bringing the accused before the court has still not begun. What is available is the material that has been submitted before the court along with the charge-sheet. In such situation, the court only has the preparatory material that has been placed before the court for its consideration in order to proceed with the trial by framing of charges. 77. It is, therefore, not any material that can be utilised, rather it is that material after cognizance is taken by a court, that is available to it while making an inquiry into or trying an offence, that the court can utilize or take into consideration for supporting reasons to summon any person on the basis of evidence adduced before the Court, who may be on the basis of such material, treated to be an accomplice in the commission of the offence. The inference that can be drawn is that material which is not exactly evidence recorded before the court, but is a material collected by the court, can be utilised to corroborate evidence already recorded for the purpose of summoning any other person, other than the accused. 78. This would harmonise such material with the word ?evidence? as material that would be supportive in nature to facilitate the exposition of any other accomplice whose complicity in the offence may have either been suppressed or escaped the notice of the court. 79. The word ?evidence? therefore has to be understood in its wider sense both at the stage of trial and, as discussed earlier, even at ",
    "_version_":1675670292432683008
 }
 